{
  "html_with_citations": "<pre class=\"inline\">                   PRELIMINARY PRINT\n\n             Volume 601 U. S. Part 2\n                             Pages 416–471\n\n\n\n\n       OFFICIAL REPORTS\n                                    OF\n\n\n   THE SUPREME COURT\n                                May 16, 2024\n\n\nPage Proof Pending Publication\n\n\n                   REBECCA A. WOMELDORF\n                           reporter of decisions\n\n\n\n\n    NOTICE: This preliminary print is subject to formal revision before\n  the bound volume is published. Users are requested to notify the Reporter\n  of Decisions, Supreme Court of the United States, Washington, D.C. 20543,\n  pio@supremecourt.gov, of any typographical or other formal errors.\n\f416                     OCTOBER TERM, 2023\n\n                                 Syllabus\n\n\n  CONSUMER FINANCIAL PROTECTION BUREAU\n   et al. v. COMMUNITY FINANCIAL SERVICES\n     ASSOCIATION OF AMERICA, LTD., et al.\ncertiorari to the united states court of appeals for\n                  the fth circuit\n      No. 22–448. Argued October 3, 2023—Decided May 16, 2024\nThe Constitution gives Congress control over the public fsc subject to the\n  command that “[n]o Money shall be drawn from the Treasury, but in\n  Consequence of Appropriations made by Law.” Art. I, § 9, cl. 7. For\n  most federal agencies, Congress provides funding through annual appro-\n  priations. For the Consumer Financial Protection Bureau, however,\n  Congress provided a standing source of funding outside the ordinary\n  annual appropriations process. Specifcally, Congress authorized the\n  Bureau to draw from the Federal Reserve System an amount that its\n  Director deems “reasonably necessary to carry out” the Bureau&#x27;s duties,\n  subject only to an infation-adjusted cap. </pre><span class=\"citation no-link\">12 U. S. C. §§ 5497</span><pre class=\"inline\">(a)(1), (2).\n  In this case, several trade associations representing payday lenders and\nPage Proof Pending Publication\n  credit-access businesses challenged regulations issued by the Bureau\n  pertaining to high-interest consumer loans on statutory and constitu-\n  tional grounds. As relevant here, the Fifth Circuit accepted the associ-\n  ations&#x27; argument that the Bureau&#x27;s funding mechanism violates the Ap-\n  propriations Clause.\nHeld: Congress&#x27; statutory authorization allowing the Bureau to draw money\n from the earnings of the Federal Reserve System to carry out the Bu-\n reau&#x27;s duties satisfes the Appropriations Clause. Pp. 424–438, 441.\n    (a) Under the Appropriations Clause, an appropriation is a law that\n authorizes expenditures from a specifed source of public money for des-\n ignated purposes. Pp. 424–435.\n       (1) The Bureau&#x27;s funding is “drawn from the Treasury” and is\n therefore subject to the requirements of the Appropriations Clause.\n The issue is whether the Bureau&#x27;s funding mechanism constitutes an\n “Appropriatio[n] made by Law.” The Court concludes that the answer\n is yes based on the Constitution&#x27;s text, the history against which that\n text was enacted, and congressional practice immediately following rati-\n fcation. Pp. 425–434.\n       (i) The Constitution&#x27;s use of the term “appropriation” provides im-\n portant insight into its meaning. The Appropriations Clause itself\n specifes that an appropriation must authorize withdrawals from a par-\n ticular source, the “Treasury.” And, the proviso limiting Congress&#x27;\n\f                      Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)                    417\n\n                                Syllabus\n\n power to “raise and support Armies”—that “no Appropriation of Money\n to that Use shall be for a longer Term than two Years”—indicates that\n appropriations assign funds for specifc uses. Contemporary dictionary\n defnitions support this conclusion as well. The evidence suggests that,\n at a minimum, appropriations were understood as a legislative means\n of authorizing expenditures from public funds for designated purposes.\n Pp. 426–427.\n      (ii) Pre-founding history supports the conclusion that an identifed\n source and purpose are all that is required for a valid appropriation.\n The concept of legislative appropriations grew out of the broader strug-\n gle between Parliament and the Crown for popular control of the purse\n in England. Parliament had little claim to direct how the Crown&#x27;s he-\n reditary revenues were spent, but “extraordinary revenues” required\n parliamentary authorization because they were fnanced through vari-\n ous forms of taxation. In granting these revenues, Parliament began\n exercising an attendant power to specify how the Crown used the funds.\n The ensuing power struggle culminated in Parliament stripping away\n the remnants of the Crown&#x27;s hereditary revenues. Subsequently, Par-\n liament&#x27;s usual practice was to appropriate government revenue to par-\n ticular purposes and to limit the duration of its revenue grants. But,\n not all appropriations were time limited. Some statutes granting\nPage Proof Pending Publication\n money gave the Crown broad discretion regarding how much to spend\n within an appropriated sum.\n      The appropriations practice in the Colonies and early state legisla-\n tures was much the same. Many early state constitutions vested the\n legislative body with power over appropriations, and state legislative\n bodies often opted for open-ended, discretionary appropriations. By\n the time of the Constitutional Convention, it was uncontroversial that\n the powers to raise and disburse public money would reside in the Leg-\n islative Branch. The origins of the Appropriations Clause confrm that\n appropriations needed to designate particular revenues for identifed\n purposes, but beyond that limit, early legislative bodies exercised a wide\n range of discretion. Pp. 427–432.\n      (iii) The practice of the First Congress also illustrates the source-\n and-purpose understanding of appropriations. Many early appropria-\n tions laws made annual lump-sum grants for the Government&#x27;s ex-\n penses. As in England, the appropriation of “sums not exceeding” a\n specifed amount provided the Executive discretion over how much to\n spend up to a cap. Congress took even more fexible approaches to\n appropriations for several early executive agencies, allowing them to\n indefnitely fund themselves from revenue collected. For example,\n Congress adopted open-ended fee- and commission-based funding\n schemes for Customs Service and the Post Offce. Pp. 432–434.\n\f418 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                       Syllabus\n\n        (2) The Bureau&#x27;s funding statute satisfes the requirements of the\n Appropriations Clause. The statute authorizes the Bureau to draw\n public funds from a particular source—“the combined earnings of the\n Federal Reserve System”— in an amount not exceeding an infation-\n adjusted cap. </pre><span class=\"citation no-link\">12 U. S. C. §§ 5497</span><pre class=\"inline\">(a)(1), (2)(A)–(B). And, it specifes the\n objects for which the Bureau can use those funds—to “pay the expenses\n of the Bureau in carrying out its duties and responsibilities.”\n § 5497(c)(1). The Bureau&#x27;s funding mechanism also fts comfortably\n within the historical appropriations practice described above. P. 435.\n     (b) The associations&#x27; three principal arguments for why the Bureau&#x27;s\n funding mechanism violates the Appropriations Clause are unpersua-\n sive. Pp. 435–438.\n        (1) The associations argue that the Bureau&#x27;s funding is not “drawn\n . . . in Consequence of Appropriations made by Law” because the agency\n itself decides the amount of annual funding to draw from the Federal\n Reserve System. But, appropriations of “sums not exceeding” a cer-\n tain amount were commonplace immediately after the founding. Con-\n gress did not violate the Appropriations Clause by permitting the\n Bureau to decide how much funding to draw up to a cap. Pp. 435–436.\n        (2) The associations suggest that the Appropriations Clause re-\n\nPage Proof Pending Publication\n quires both Chambers of Congress to periodically agree on an agency&#x27;s\n funding, which ensures that each Chamber reserves the power to unilat-\n erally block those funding measures through inaction. While the Con-\n stitution expressly provides that “no Appropriation of Money” to sup-\n port an army “shall be for a longer Term than two Years,” Art. I, § 8,\n cl. 12, the Constitution does not explicitly limit the duration of appropri-\n ations for other purposes. The First Congress&#x27; practice confrms this\n understanding, as appropriations that supplied funding to the Customs\n Service and the Post Offce were not time limited. The associations\n resist the analogy to the Post Offce and other fee-based agencies, ar-\n guing that such agencies do not enjoy the same level of fscal independ-\n ence as the Bureau. But, the associations fail to explain the relevance\n of that difference to the question whether a law complies with the con-\n stitutional imperative of an appropriation. Pp. 436–437.\n        (3) Finally, the associations contend that if the Bureau&#x27;s funding\n mechanism is consistent with the Appropriations Clause, then Congress\n could do the same for any—or every—civilian agency, allowing the Ex-\n ecutive to operate free of any meaningful fscal check. But, the Appro-\n priations Clause is simply a limitation on Congress&#x27; power over the\n purse, and the associations err by reducing the power of the purse to\n only the principle expressed in the Appropriations Clause. They offer\n no defensible argument that the Appropriations Clause requires more\n\f                       Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)                   419\n\n                                 Syllabus\n\n  than a law that authorizes the disbursement of specifed funds for identi-\n  fed purposes. Pp. 437–438.\n</pre><span class=\"citation no-link\">51 F. 4th 616</span><pre class=\"inline\">, reversed and remanded.\n\n  Thomas, J., delivered the opinion of the Court, in which Roberts, C. J.,\nand Sotomayor, Kagan, Kavanaugh, Barrett, and Jackson, JJ., joined.\nKagan, J., fled a concurring opinion, in which Sotomayor, Kavanaugh,\nand Barrett, JJ., joined, post, p. 441. Jackson, J., fled a concurring\nopinion, post, p. 445. Alito, J., fled a dissenting opinion, in which Gor-\nsuch, J., joined, post, p. 447.\n\n  Solicitor General Prelogar argued the cause for petition-\ners. With her on the briefs were Principal Deputy Assist-\nant Attorney General Boynton, Deputy Solicitor General\nFletcher, Benjamin W. Snyder, Ephraim A. McDowell,\nMark R. Freeman, Melissa N. Patterson, and Steven Y.\nBressler.\n  Noel J. Francisco argued the cause for respondents.\nWith him on the brief were Christian G. Vergonis, Hashim\nPage Proof Pending Publication\nM. Mooppan, and Yaakov M. Roth.*\n\n   *Briefs of amici curiae urging reversal were fled for the State of New\nYork et al. by Letitia James, Attorney General of New York, Barbara\nD. Underwood, Solicitor General, Ester Murdukhayeva, Deputy Solicitor\nGeneral, and Dennis Fan, Senior Assistant Solicitor General, and by the\nAttorneys General for their respective jurisdictions as follows: Kris Mayes\nof Arizona, Rob Bonta of California, Philip J. Weiser of Colorado, William\nTong of Connecticut, Kathleen Jennings of Delaware, Brian L. Schwalb\nof the District of Columbia, Anne E. Lopez of Hawaii, Kwame Raoul of\nIllinois, Aaron M. Frey of Maine, Anthony G. Brown of Maryland, Andrea\nJoy Campbell of Massachusetts, Dana Nessel of Michigan, Keith Ellison\nof Minnesota, Aaron D. Ford of Nevada, Matthew J. Platkin of New Jer-\nsey, Raúl Torrez of New Mexico, Joshua H. Stein of North Carolina, Ellen\nF. Rosenblum of Oregon, Michelle A. Henry of Pennsylvania, Peter F.\nNeronha of Rhode Island, Charity R. Clark of Vermont, Robert W. Fergu-\nson of Washington, and Joshua L. Kaul of Wisconsin; for AARP et al. by\nMaame Gyamf, William Alvarado Rivera, and Julie Nepveu; for Com-\nmunity Development Financial Institutions et al. by Richard A. Koffman;\nfor Current and Former Members of Congress by Hyland Hunt and Ruth-\nanne M. Deutsch; for Farm Action et al. by Rachel L. Fried and Jeffrey\nB. Dubner; for Financial Regulation Scholars by Gregory M. Lipper and\n\f420 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                   Opinion of the Court\n\n  Justice Thomas delivered the opinion of the Court.\n  Our Constitution gives Congress control over the public\nfsc, but it specifes that its control must be exercised in a\n\nAdam J. Levitin, pro se; for the Lawyers&#x27; Committee for Civil Rights\nUnder Law et al. by Damon Hewitt, Jon Greenbaum, Thomas Silverstein,\nand Jeffrey Gentes; for Military and Veterans Organizations by Carolyn\nE. Shapiro and John Paul Schnapper-Casteras; for the National Treasury\nEmployees Union by Julie M. Wilson, Paras N. Shah, and Allison C.\nGiles; for Professors of History et al. by Elizabeth B. Wydra, Brianne J.\nGorod, and Brian R. Frazelle; for Ten Consumer Advocacy Organizations\nby Scott L. Nelson and Allison M. Zieve; and for 90 State and Local Non-\nproft Organizations by Seth E. Mermin.\n   Briefs of amici curiae urging affrmance were fled for the State of West\nVirginia et al. by Patrick Morrisey, Attorney General of West Virginia,\nLindsay S. See, Solicitor General, and Michael R. Williams, Principal\nDeputy Solicitor General, by John Scott, Provisional Attorney General of\nTexas, and by the Attorneys General for their respective States as follows:\nSteve Marshall of Alabama, Treg Taylor of Alaska, Tim Griffn of Arkan-\nsas, Ashley Moody of Florida, Chris Carr of Georgia, Raúl Labrador of\nPage Proof Pending Publication\nIdaho, Todd Rokita of Indiana, Brenna Bird of Iowa, Kris Kobach of Kan-\nsas, Daniel Cameron of Kentucky, Jeff Landry of Louisiana, Lynn Fitch\nof Mississippi, Andrew Bailey of Missouri, Austin Knudsen of Montana,\nMichael T. Hilgers of Nebraska, John M. Formella of New Hampshire,\nDrew Wrigley of North Dakota, Dave Yost of Ohio, Gentner Drummond\nof Oklahoma, Alan Wilson of South Carolina, Marty Jackley of South\nDakota, Jonathan Skrmetti of Tennessee, Sean D. Reyes of Utah, Jason\nMiyares of Virginia, and Bridget Hill of Wyoming; for ACA International\nby Christopher O. Murray; for America&#x27;s Future et al. by William J.\nOlson and Jeremiah L. Morgan; for the Americans for Prosperity Founda-\ntion by Michael Pepson; for the Atlantic Legal Foundation by Lawrence\nS. Ebner and Herbert L. Fenster; for the Center for Constitutional Juris-\nprudence by John C. Eastman and Anthony T. Caso; for the Chamber of\nCommerce of the United States of America et al. by Cameron T. Norris\nand Jennifer B. Dickey; for the Credit Union National Association, Inc.,\net al. by Julian R. Ellis, Jr., and Leah C. Dempsey; for Former Members\nof Congress by Helgi C. Walker, Lucas C. Townsend, Russell Balikian,\nand Lochlan F. Shelfer; for the Foundation for Government Accountability\nby Stewart L. Whitson; for the Landmark Legal Foundation by Matthew\nC. Forys, Michael J. O&#x27;Neill, and Richard P. Hutchison; for the New Civil\nLiberties Alliance et al. by Richard A. Samp, Margaret A. Little, and\nMark S. Chenoweth; for the New England Legal Foundation by Mark\n\f                      Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)                   421\n\n                          Opinion of the Court\n\nspecifc manner. The Appropriations Clause commands that\n“[n]o Money shall be drawn from the Treasury, but in Conse-\nquence of Appropriations made by Law.” Art. I, § 9, cl. 7.\nFor most federal agencies, Congress provides funding on an\nannual basis. This annual process forces them to regularly\nimplore Congress to fund their operations for the next year.\nThe Consumer Financial Protection Bureau is different.\nThe Bureau does not have to petition for funds each year.\nInstead, Congress authorized the Bureau to draw from the\nFederal Reserve System the amount its Director deems\n“reasonably necessary to carry out” the Bureau&#x27;s duties, sub-\nject only to an infation-adjusted cap. </pre><span class=\"citation no-link\">124 Stat. 1975</span><pre class=\"inline\">, </pre><span class=\"citation no-link\">12\nU. S. C. §§ 5497</span><pre class=\"inline\">(a)(1), (2). In this case, we must decide the\nnarrow question whether this funding mechanism complies\nwith the Appropriations Clause. We hold that it does.\n\n                                    I\n                          A\nPage     Proof      Pending        Publication\n Congress enacted the Dodd-Frank Wall Street Reform and\nConsumer Protection Act in response to the 2008 fnancial\ncrisis. </pre><span class=\"citation no-link\">124 Stat. 1376</span><pre class=\"inline\">. The Act created an independent\nfinancial regulator within the Federal Reserve System\nknown as the Bureau of Consumer Financial Protection. </pre><span class=\"citation no-link\">12\nU. S. C. § 5491</span><pre class=\"inline\">(a). Congress charged the Bureau with en-\nforcing consumer fnancial protection laws to ensure “that\nall consumers have access to markets for consumer fnancial\nproducts and services and that markets for consumer fnan-\ncial products and services are fair, transparent, and competi-\ntive.” § 5511(a). The Act consolidated in the Bureau the\n\nA. Perry, Joshua M. Wesneski, and Daniel B. Winslow; for the Third\nParty Payment Processors Association by Misha Tseytlin; for the Wash-\nington Legal Foundation by John M. Masslon II and Cory L. Andrews; for\nJohn Michael Mulvaney by Brunn W. Roysden III; and for 132 Members\nof Congress by Jennifer L. Mascott and R. Trent McCotter.\n   Robert M. Loeb fled a brief for the Mortgage Bankers Association et al.\nas amici curiae.\n\f422 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                   Opinion of the Court\n\nauthority to administer 18 existing consumer protection stat-\nutes, among them the Fair Debt Collection Practices Act, the\nFair Credit Reporting Act, and the Home Mortgage Disclo-\nsure Act of 1975. §§ 5512(a), 5481(12), (14). Additionally,\nthe Act made it unlawful for those offering consumer fnan-\ncial products and services “to engage in any unfair, decep-\ntive, or abusive act or practice.” § 5536(a)(1)(B). Congress\nvested the Bureau with rulemaking, enforcement, and adju-\ndicatory authority over the statutes that it administers.\nSee §§ 5531(a)–(b), 5581(a)(1)(A), (b) (rulemaking authority);\n§§ 5562–5565 (enforcement and adjudicatory authority).\n   In addition to vesting the Bureau with sweeping authority,\nCongress shielded the Bureau from the infuence of the polit-\nical branches. To insulate the Bureau from the President&#x27;s\ncontrol, Congress put a single Director with a 5-year term\nat the Bureau&#x27;s helm and made the Director removable only\nfor ineffciency, neglect, or malfeasance. §§ 5491(b)–(c).\nPage Proof Pending Publication\nThis Court held in Seila Law LLC v. Consumer Finan-\ncial Protection Bureau, </pre><span class=\"citation no-link\">591 U. S. 197</span><pre class=\"inline\"> (2020), that the\ncombination of single-Director leadership and for-cause re-\nmoval protection unconstitutionally circumscribed the Pres-\nident&#x27;s ability to oversee the Executive Branch. </pre><span class=\"citation no-link\">Id.,\nat 208</span><pre class=\"inline\">.\n   This case involves another one of the Bureau&#x27;s novel struc-\ntural features, one that limits Congress&#x27; control. Congress\nsupplies most federal agencies with the funds necessary for\ntheir operations only on an annual basis, so those agencies\nmust ask Congress for renewed funding each year. For the\nBureau, however, Congress diminished this accountability by\nproviding the Bureau a standing source of funding outside\nthe ordinary annual appropriations process. Each year, the\nBureau may requisition from the earnings of the Federal Re-\nserve System “the amount determined by the [Bureau&#x27;s] Di-\nrector to be reasonably necessary to carry out” its duties,\nsubject only to a statutory cap. § 5497(a)(1). The Bureau\ncannot request more than 12 percent of the Federal Reserve\n\f                  Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)           423\n\n                     Opinion of the Court\n\nSystem&#x27;s total operating expenses as reported in fscal year\n2009 (adjusted for infation). §§ 5497(a)(2)(A)–(B). In fscal\nyear 2022, that cap was about $734 million. See Consumer\nFinancial Protection Bureau, Financial Report of the Con-\nsumer Financial </pre><span class=\"citation no-link\">Protection Bureau 7</span><pre class=\"inline\"> (Fiscal year 2022).\nThe Bureau can also retain and invest unused funds from\nyear to year, though the Director must take into account\nany surplus when requesting additional funds. §§ 5497(a)(1),\n(b)(3), (c).\n                              B\n  In 2017, the Bureau promulgated a regulation focused on\nhigh-interest consumer loans. See Payday, Vehicle Title,\nand Certain High-Cost Installment Loans, 12 CFR pt. 1041\n(2018) (Payday Lending Rule). Among other things, the\nregulation restricts lenders&#x27; ability to obtain loan payments\nthrough preauthorized account access after two unsuccess-\nful withdrawal attempts. Ibid. The Community Financial\nPage Proof Pending Publication\nServices Association of America and Consumer Service Alli-\nance of Texas, trade associations that represent payday lend-\ners and credit-access businesses, challenged the Payday\nLending Rule on statutory and constitutional grounds. In\nthe operative complaint, the associations argued, among\nother things, that the Bureau “takes federal government\nmoney without an appropriations act” in violation of the\nAppropriations Clause. Amended Complaint in No. 1:18–\ncv–00295 (WD Tex.), ECF Doc. 76, p. 30.\n  The District Court granted summary judgment to the Bu-\nreau. As relevant, the court explained that “[t]he Appropri-\nations Clause `means simply that no money can be paid out\nof the Treasury unless it has been appropriated by an act of\nCongress.&#x27; ” </pre><span class=\"citation no-link\">558 F. Supp. 3d 350</span><pre class=\"inline\">, 364 (WD Tex. 2021) (quot-\ning Offce of Personnel Management v. Richmond, </pre><span class=\"citation\" data-id=\"9432059\"><a href=\"/opinion/112458/office-of-personnel-management-v-richmond/#424\" aria-description=\"Citation for case: Office of Personnel Management v. Richmond\">496 U. S.\n414, 424</a></span><pre class=\"inline\"> (1990)). And, because “a statute authorizes” the\ndisbursements from the Federal Reserve System&#x27;s combined\nearnings to the Bureau “up to a certain cap,” the District\nCourt concluded, “there is no Appropriations Clause issue.”\n\f424 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                   Opinion of the Court\n\n558 F. Supp. 3d, at 364. On appeal, the associations renewed\ntheir argument that the “Bureau&#x27;s funding mechanism\nusurps Congress&#x27;s role in the appropriation of federal funds”\nby allowing it to take “federal money without an appropria-\ntions act.” Brief for Appellants in No. 21–50826 (CA5),\np. 28.\n   The Court of Appeals agreed with this argument and re-\nversed. </pre><span class=\"citation no-link\">51 F. 4th 616</span><pre class=\"inline\"> (CA5 2022). Drawing on the Consti-\ntution&#x27;s text and history, the court concluded that the Appro-\npriations Clause “does more than reinforce Congress&#x27;s power\nover fscal matters; it affrmatively obligates Congress to use\nthat authority `to maintain the boundaries between the\nbranches and preserve individual liberty from the encroach-\nments of executive power.&#x27; ” </pre><span class=\"citation no-link\">Id.,</span><pre class=\"inline\"> at 637 (quoting Consumer\nFinancial Protection Bureau v. All Am. Check Cashing,\nInc., </pre><span class=\"citation no-link\">33 F. 4th 218</span><pre class=\"inline\">, 231 (CA5 2022) (en banc) (Jones, J., concur-\nring)). By giving the Bureau a “self-actualizing, perpetual\nfunding mechanism,” the court reasoned, Congress in effect\nPage Proof Pending Publication\nabandoned this obligation. 51 F. 4th, at 638–639. It was\nnot enough that Congress enacted the law authorizing the\nBureau&#x27;s funding because a “law alone does not suffce—an\nappropriation is required.” </pre><span class=\"citation no-link\">Id., at 640</span><pre class=\"inline\">. The court thus\nheld that the Bureau&#x27;s funding mechanism violates the\nAppropriations Clause. </pre><span class=\"citation no-link\">Id., at 642</span><pre class=\"inline\">.\n   We granted certiorari to address the narrow question\nwhether the statute that provides funding to the Bureau vio-\nlates the Appropriations Clause. 598 U. S. ––– (2023). We\nnow reverse.\n                                II\n  Under the Appropriations Clause, an appropriation is sim-\nply a law that authorizes expenditures from a specifed\nsource of public money for designated purposes. The stat-\nute that provides the Bureau&#x27;s funding meets these require-\nments. We therefore conclude that the Bureau&#x27;s funding\nmechanism does not violate the Appropriations Clause.\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)            425\n\n                      Opinion of the Court\n\n                                A\n   The Appropriations Clause provides that “[n]o Money shall\nbe drawn from the Treasury, but in Consequence of Appro-\npriations made by Law.” Art. I, § 9, cl. 7. Textually, the\ncommand is unmistakable—“no money can be paid out of the\nTreasury unless it has been appropriated by an act of Con-\ngress.” Cincinnati Soap Co. v. United States, </pre><span class=\"citation\" data-id=\"102824\"><a href=\"/opinion/102824/cincinnati-soap-co-v-united-states/#321\" aria-description=\"Citation for case: Cincinnati Soap Co. v. United States\">301 U. S. 308,\n321</a></span><pre class=\"inline\"> (1937). Our decisions have long given the Appropria-\ntions Clause this straightforward reading. See, e. g., Offce\nof Personnel Management, </pre><span class=\"citation\" data-id=\"9432059\"><a href=\"/opinion/112458/office-of-personnel-management-v-richmond/#424\" aria-description=\"Citation for case: Office of Personnel Management v. Richmond\">496 U. S., at 424</a></span><pre class=\"inline\"> (“Money may be\npaid out only through an appropriation made by law; in other\nwords, the payment of money from the Treasury must be\nauthorized by a statute”); Reeside v. Walker, </pre><span class=\"citation\" data-id=\"86644\"><a href=\"/opinion/86644/reeside-v-walker/#291\" aria-description=\"Citation for case: Reeside v. Walker\">11 How. 272,\n291</a></span><pre class=\"inline\"> (1851) (“However much money may be in the Treasury\nat any one time, not a dollar of it can be used in the payment\nof any thing not . . . previously sanctioned” through an appro-\npriation made by Congress).\nPage Proof Pending Publication\n   As a threshold matter, the parties agree that the Bureau&#x27;s\nfunding must comply with the Appropriations Clause. The\nAppropriations Clause applies to money “drawn from the\nTreasury.” Art. I, § 9, cl. 7. The Bureau draws money from\nthe Federal Reserve System. </pre><span class=\"citation no-link\">12 U. S. C. § 5497</span><pre class=\"inline\">(a)(1). And,\nsurplus funds in the Federal Reserve System would other-\nwise be deposited into the general fund of the Treasury.\n§ 289(a)(3)(B). Whatever the scope of the term “Treasury”\nin the Appropriations Clause, money otherwise destined for\nthe general fund of the Treasury qualifes. The Bureau&#x27;s\nfunding is therefore subject to the requirements of the Ap-\npropriations Clause.\n   The associations&#x27; challenge turns solely on whether the\nBureau&#x27;s funding mechanism constitutes an “Appropriatio[n]\nmade by Law.” This question divided the courts below.\nThe District Court concluded that a valid appropriation is\nnothing more than a statute that “authorizes an agency to\nreceive funds up to a certain cap.” 558 F. Supp. 3d, at 364;\n\f426 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                   Opinion of the Court\n\nsee also Consumer Financial Protection Bureau v. Law Of-\nfces of Crystal Moroney P. C., </pre><span class=\"citation no-link\">63 F. 4th 174</span><pre class=\"inline\">, 181 (CA2 2023).\nThe Court of Appeals, on the other hand, suggested that ap-\npropriations must also “meet the Framers&#x27; salutary aims of\nseparating and checking powers and preserving accountabil-\nity to the people.” 51 F. 4th, at 640. The associations de-\nfend this understanding and argue that the statute that pro-\nvides the Bureau&#x27;s funding undermines these aims by\nallowing the agency to indefnitely choose its own level of\nannual funding, subject only to an illusory cap. That is, the\nassociations contend that the Bureau&#x27;s funding mechanism is\ntoo open-ended in duration and amount to satisfy the re-\nquirement that there be an “Appropriatio[n] made by Law.”\n   Based on the Constitution&#x27;s text, the history against which\nthat text was enacted, and congressional practice immedi-\nately following ratifcation, we conclude that appropriations\nneed only identify a source of public funds and authorize the\nexpenditure of those funds for designated purposes to satisfy\nPage Proof Pending Publication\nthe Appropriations Clause.\n                              1\n   The Constitution&#x27;s text requires an “Appropriatio[n] made\nby Law.” Art. I, § 9, cl. 7. Our concern is principally with\nthe meaning of the word “appropriation.” The Constitu-\ntion&#x27;s use of the term “appropriation” in the Appropriations\nClause and in other Clauses provides important contextual\nclues about its meaning. To state the obvious, the Appro-\npriations Clause itself makes clear that an appropriation\nmust authorize withdrawals from a particular source—the\npublic treasury. It provides that money may be “drawn\nfrom the Treasury” only “in Consequence of Appropriations\nmade by Law.” Ibid. The section preceding the Appropri-\nations Clause further suggests that appropriations assign\nfunds for specifc uses: Congress has the power to “raise and\nsupport Armies,” but subject to the limitation that “no Ap-\npropriation of Money to that Use shall be for a longer Term\nthan two Years.” § 8, cl. 12.\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)            427\n\n                      Opinion of the Court\n\n   At the time the Constitution was ratifed, “appropriation”\nmeant “[t]he act of sequestering, or assigning to a particular\nuse or person, in exclusion of all others.” 1 N. Webster, An\nAmerican Dictionary of the English Language (1828); see\nalso 1 J. Ash, The New and Complete Dictionary of the Eng-\nlish Language (2d ed. 1795) (“[t]he application of something\nto a particular use”); 1 S. Johnson, A Dictionary of the\nEnglish Language (6th ed. 1785) (“[t]he application of some-\nthing to a particular purpose”); T. Dyche &amp; W. Pardon, A\nNew General English Dictionary (14th ed. 1771) (“the ap-\npointing a thing to a particular use”). In ordinary usage,\nthen, an appropriation of public money would be a law au-\nthorizing the expenditure of particular funds for specifed\nends.\n   Taken as a whole, this evidence suggests that, at a mini-\nmum, appropriations were understood as a legislative means\nof authorizing expenditure from a source of public funds for\ndesignated purposes.\nPage Proof Pending Publication 2\n   Pre-founding history supports the conclusion that an iden-\ntifed source and purpose are all that is required for a valid\nappropriation. The concept of legislative “appropriations”\ngrew out of the broader struggle for popular control of the\npurse in England. Throughout the Middle Ages, the King\nenjoyed near total fscal independence. At that time, the\nKing&#x27;s revenues came largely from hereditary sources, some-\ntimes called “ordinary” revenues. 1 W. Blackstone, Com-\nmentaries on the Laws of England 281 (1771) (Commentar-\nies). These ordinary revenues fowed from many sources,\nincluding the “rents and profts of the demesne lands of the\ncrown,” id., at 286, and the fnes, forfeitures, and fees “aris-\ning from the king&#x27;s ordinary courts of justice,” id., at 289.\nBecause this revenue inhered in the King himself, Parlia-\nment had little claim to direct how it was spent. See F.\nMaitland, The Constitutional History of England 430 (1908)\n(Maitland).\n\f428 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                   Opinion of the Court\n\n   But, when these unencumbered ordinary revenues did not\nsatisfy the demands of royal governance, most often during\nwartime, the King had to seek what Blackstone called “ex-\ntraordinary revenue.” Commentaries 306. Extraordinary\nrevenues were fnanced through various forms of taxation\nand therefore required parliamentary authorization. Id., at\n169, 307; see Magna Charta, ch. 12 (1215), in A. Howard,\nMagna Carta: Text and Commentary 40 (rev. ed. 1998). In\ngranting extraordinary revenues, Parliament began exercis-\ning an attendant power to specify how the Crown used these\nfunds. Maitland 183–184; see also T. Taswell-Langmead,\nEnglish Constitutional History: From the Teutonic Conquest\nto the Present Time 219, 229 (6th ed. 1905). That is, Parlia-\nment “claimed the power to appropriate the supplies granted\nto the king.” Maitland 183–184.\n   Conditions in the 17th century shifted the balance of\npower toward Parliament. A combination of rising prices\nPage Proof Pending Publication\nand increasing demands made it so that the King&#x27;s ordinary\nrevenues could not satisfy the costs of royal governance,\neven in times of peace. D. Keir, The Constitutional History\nof Modern Britain Since 1485, pp. 180–181 (6th ed. 1960);\nP. Einzig, The Control of the Purse 57 (1959). The King&#x27;s\nfnancial weakness, and Parliament&#x27;s increasing assertive-\nness in appropriating extraordinary revenues, led to intra-\ngovernmental strife. The ensuing power struggle culmi-\nnated in the Glorious Revolution, in which Parliament\nstripped away the remnants of the King&#x27;s hereditary reve-\nnues and thereby secured supremacy in fscal matters.\nCommentaries 306, 333; Maitland 434.\n   Following the Glorious Revolution, Parliament&#x27;s usual\npractice was to appropriate government revenue “to particu-\nlar purposes more or less narrowly defned.” Id., at 433.\nAdditionally, Parliament began limiting the duration of its\nrevenue grants. For example, the duties on tonnage and\npoundage were no longer granted to the King for life, but\nonly for a term of years. See 2 Wm. &amp; Mary, c. 4, § 1 (1690);\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)             429\n\n                      Opinion of the Court\n\n6 Wm. &amp; Mary, c. 1, § 1 (1694); see also D. Gill, The Treasury,\n1660–1714, 46 Eng. Hist. Rev. 600, 610 (1931). Limiting the\nduration of these and other revenue grants ensured that the\nKing could not rule without Parliament. As one historian\ndescribed it, Parliament made sure “the Crown should be\naltogether unable to pay its way without an annual meeting\nof Parliament. . . . Every year he and his Ministers had to\ncome, cap in hand, to the House of Commons, and more often\nthan not the Commons drove a bargain and exacted a quid\npro quo in return for supply.” G. Trevelyan, The English\nRevolution 1688–1689, pp. 180–181 (1939).\n   Even with this newfound fscal supremacy, Parliament did\nnot micromanage every aspect of the King&#x27;s fnances. Not\nall post-Glorious Revolution grants of supplies were time\nlimited. A notable exception involved what came to be\nknown as the civil list. Despite its established power to\nlimit the duration of revenue grants, Parliament deemed it\nPage Proof Pending Publication\nproper to cover the expenses of the King&#x27;s household and the\ncivil government by appropriating revenue to that purpose\nfor life. Maitland 435–436; see also E. Reitan, The Civil List\nin Eighteenth-Century British Politics, 9 Hist. J. 318, 319\n(1966) (Reitan) (explaining that the “Crown was to meet the\ncosts of the civil government” out of the civil list, including\n“the fees and salaries of the ministers and many other public\noffcers, the salaries of many of the small fry in various gov-\nernment departments, the salaries and pensions of judges,\nthe salaries and allowances of ambassadors and consuls, and\nthe maintenance of buildings for Parliament and the public\noffces”). And, parliamentary grants of supplies ordinarily\ngave the Crown broad discretion regarding how much to\nspend within an appropriated sum. Statutes granting\nmoney often stated that the Crown could spend “any Sum\nnot exceeding” a particular amount. See, e.g., 13 Anne,\nc. 18, § 69 (1713); 1 Anne, c. 6, § 130 (1702). These grants\nwere permissive. As Maitland explained, “Money is granted\nto the queen; it is placed at the disposal of her and her minis-\n\f430 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                   Opinion of the Court\n\nters. But she and they are not bound by law to spend it, at\nleast not bound by the Appropriation Act.” Maitland 445.\nOther parliamentary appropriations acts, however, required\nthat money be spent for particular purposes. See, e.g., 2\nWm. &amp; Mary, c. 1, §§ 35–36 (1690); 3 Wm. &amp; Mary, c. 5, §§ 42–\n43 (1691); see also M. Rappaport, The Selective Nondelega-\ntion Doctrine and the Line Item Veto, 76 Tulane L. Rev. 265,\n327, n. 211 (2001) (Rappaport).\n   The appropriations practice in the Colonies and early state\nlegislatures was much the same. “When called upon to\ngrant supplies,” the lower houses in the colonial assemblies\n“insisted upon appropriating them in detail.” J. Greene,\nThe Quest for Power: The Lower Houses of Assembly in the\nSouthern Royal Colonies 1689–1776, p. 88 (1963). Many\nearly state constitutions vested the legislative body with\npower over appropriations. Rappaport 332–333. And, in\nexercising that authority, state legislative bodies often opted\nPage Proof Pending Publication\nfor open-ended, discretionary appropriations. See, e.g., Act\nof Mar. 31, 1788, 1787 Mass. Acts and Laws ch. 63, p. 657\n(“[T]he amount of all duties collected by virtue of this Act\nshall be, and is hereby appropriated to &amp; for the support of\nthe civil government of this Commonwealth”); Act of Nov.\n17, 1786, 1786 Mass. Acts and Laws ch. 47, p. 117 (appropriat-\ning one-third of revenue “for the exigencies of Government”);\nAn act to amend and reduce the several acts for appropriat-\ning the public revenue, into one act, 1784 Va. Acts ch. 46, § 1,\nreprinted in 11 W. Hening&#x27;s Statutes at Large 434 (1823)\n(“The money arising [from certain taxes] shall form a general\nfund, ten thousand pounds of which per annum shall be at the\ndisposal of the executive, to defray the contingent charges of\ngovernment”); An act to amend the act for appropriating the\npublic revenue, 1783 Va. Acts ch. 11, § 4, reprinted in id., at\n248 (Half of “all the revenue arising from the tax on free\nmale tithables . . . shall be applied . . . to the support of civil\ngovernment”); An act for the defence of the bay, and to\n\f                    Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)              431\n\n                       Opinion of the Court\n\nimpose certain duties on imported articles, 1783 Md. Acts\nch. 26, § 5, reprinted in 1 W. Kilty, The Laws of Maryland\n(1799) (“[A]ll the duties imposed by this act on the trade of\nthis state shall be appropriated for the defence of the bay\nand the protection of trade”).\n   By the time of the Constitutional Convention, the principle\nof legislative supremacy over fscal matters engendered little\ndebate and created no disagreement. It was uncontrover-\nsial that the powers to raise and disburse public money\nwould reside in the Legislative Branch. The only disagree-\nment was about whether the right to originate taxation and\nappropriations bills should rest in a legislative body with\nproportionate representation. Having reached a tentative\nagreement on that difference, the Committee of Detail re-\nported a draft constitution giving the House of Representa-\ntives the power to originate all revenue and appropriations\nlaws. This proposed draft contained the prototype of what\nPage Proof Pending Publication\nlater became the Appropriations Clause. It provided that\n“[a]ll bills for raising or appropriating money . . . shall origi-\nnate in the House of Representatives, and shall not be al-\ntered or amended by the Senate. No money shall be drawn\nfrom the public Treasury, but in pursuance of appropriations\nthat shall originate in the House of Representatives.” 2\nRecords of the Federal Convention of 1787, p. 178 (M. Far-\nrand ed. 1911). Ultimately, the Convention agreed to grant\nthe House an exclusive power to originate revenue laws but\nnot for appropriations laws. Compare Art. I, § 7, cl. 1, with\n§ 9, cl. 7.\n   In short, the origins of the Appropriations Clause confrm\nthat appropriations needed to designate particular revenues\nfor identifed purposes. Beyond that, however, early legis-\nlative bodies exercised a wide range of discretion. Some ap-\npropriations required expenditure of a particular amount,\nwhile others allowed the recipient of the appropriated money\nto spend up to a cap. Some appropriations were time lim-\n\f432 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                   Opinion of the Court\n\nited, others were not. And, the specifcity with which ap-\npropriations designated the objects of the expenditures var-\nied greatly.\n                             3\n   The practice of the First Congress also illustrates the\nsource-and-purpose understanding of appropriations. This\npractice “provides contemporaneous and weighty evidence of\nthe Constitution&#x27;s meaning.” Bowsher v. Synar, </pre><span class=\"citation\" data-id=\"9430708\"><a href=\"/opinion/111756/bowsher-v-synar/#723\" aria-description=\"Citation for case: Bowsher v. Synar\">478 U. S.\n714, 723</a></span><pre class=\"inline\"> (1986) (internal quotation marks omitted).\n   Many early appropriations laws made annual lump-sum\ngrants for the Government&#x27;s expenses. Congress&#x27; frst an-\nnual appropriations law, for instance, divided Government\nexpenditures into four broad categories and authorized dis-\nbursements up to certain amounts for those purposes. For\nexample, the law appropriated a “sum not exceeding two\nhundred and sixteen thousand dollars for defraying the ex-\npenses of the civil list,” which covered most nonmilitary ex-\nPage Proof Pending Publication\necutive offcers&#x27; salaries and expenses. Act of Sept. 29,\n1789, ch. 23, </pre><span class=\"citation no-link\">1 Stat. 95</span><pre class=\"inline\">; see 5 Papers of Alexander Hamilton\n381–388 (H. Syrett &amp; J. Cooke eds. 1962) (reporting detailed\nline-item estimates for civil-list expenditures). And, it ap-\npropriated “a sum not exceeding one hundred and thirty-\nseven thousand dollars for defraying the expenses of the de-\npartment of war.” </pre><span class=\"citation no-link\">1 Stat. 95</span><pre class=\"inline\">. The law specifed that the\ndisbursements would “be paid out of the monies which arise,\neither from the requisitions heretofore made upon the sev-\neral states, or from the duties on impost and tonnage.”\n</pre><span class=\"citation no-link\">Ibid.</span><pre class=\"inline\"> Subsequent annual appropriations laws followed a\nsimilar pattern. See Act of Mar. 26, 1790, ch. 4, </pre><span class=\"citation no-link\">1 Stat. 104</span><pre class=\"inline\">;\nAct of Feb. 11, 1791, ch. 6, </pre><span class=\"citation no-link\">1 Stat. 190</span><pre class=\"inline\">; Act of Dec. 23, 1791,\nch. 3, </pre><span class=\"citation no-link\">1 Stat. 226</span><pre class=\"inline\">.\n   The appropriation of “sums not exceeding” a specifed\namount did not by itself mandate that the Executive spend\nthat amount; as was the case in England, such appropriations\ninstead provided the Executive discretion over how much to\nspend up to a cap. In 1803, for instance, Congress appro-\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)           433\n\n                      Opinion of the Court\n\npriated “a sum not exceeding ffty thousand dollars” to build\nup to “ffteen gun boats.” Act of Feb. 28, 1803, ch. 11, </pre><span class=\"citation no-link\">2\nStat. 206</span><pre class=\"inline\">. President Jefferson subsequently reported, how-\never, that “[t]he sum of ffty thousand dollars appropriated\nby Congress for providing gun boats remains unexpended.\nThe favorable and peaceable turn of affairs on the Mississippi\nrendered an immediate execution of that law unnecessary.”\n13 Annals of Cong. 14 (1803).\n   Congress took even more fexible approaches to appropria-\ntions for several early executive agencies and allowed the\nagencies to indefnitely fund themselves directly from reve-\nnue collected. Soon after convening, Congress enacted laws\nthat imposed a detailed schedule of duties on imported goods\nand tonnage. See Act of July 4, 1789, ch. 2, 1 Stat. 24–27\n(imposing duties on imported goods, wares, and merchan-\ndises); Act of July 20, 1789, ch. 3, 1 Stat. 27–28 (imposing\nduties on tonnage). It then divided the Nation into customs\nPage Proof Pending Publication\ndistricts and established a vast federal bureaucracy to over-\nsee the collection of those duties. Act of July 31, 1789,\nch. 5, 1 Stat. 29–49. Rather than fund those customs off-\ncials through annual appropriations, Congress opted for a\nfee-based model. Customs collectors were compensated\nthrough tonnage- and transaction-based fees specifed by law,\nand through a commission on the amount of duties raised\nwithin their districts. For example, customs collectors were\nentitled to collect from merchants two-and-a-half dollars “for\nevery entrance of any ship or vessel of one hundred tons\nburthen or upwards” and 20 cents “for every permit to land\ngoods.” </pre><span class=\"citation no-link\">Id., at 44</span><pre class=\"inline\">. And, collectors in the largest ports\nwere paid “half a per centum on the amount of all monies by\nthem respectively received and paid into the treasury of the\nUnited States.” </pre><span class=\"citation no-link\">Id., at 45</span><pre class=\"inline\">. Other customs functionaries\nwere also compensated on a fee basis. For instance, cus-\ntoms collectors paid weighers 18 cents “out of the revenue”\ncollected “for the measurement of every one hundred bushels\nof salt or grain.” </pre><span class=\"citation no-link\">Ibid.</span><pre class=\"inline\">\n\f434 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                   Opinion of the Court\n\n   Congress adopted a similarly open-ended funding scheme\nfor the Post Offce. Instead of appropriating funds on an\nannual basis, Congress authorized the Postmaster General to\n“defray the expense” of carrying the mail of the United\nStates with the revenues generated through postage assess-\nments. Act of Feb. 20, 1792, § 3, </pre><span class=\"citation no-link\">1 Stat. 234</span><pre class=\"inline\">. The postal\nstatute also provided the Postmaster General a $2,000 annual\nsalary “to be paid . . . out of the revenues of the post-offce.”\n§ 8, id., at 235. And, it authorized the Postmaster General\nto pay deputy postmasters “such commission on the monies\narising from the postage of letters and packets, as he shall\nthink adequate to their respective services,” subject to an\nupper limit. § 23, id., at 238. These fee-based funding\nschemes continued year after year without Congress passing\nan annual appropriation for these agencies.\n   These fee- and commission-based funding schemes were\nnot an American innovation; they emulated the colonial pre-\nPage Proof Pending Publication\ncursors to the Customs Service and Post Offce. Colonial\ncustoms offcers, for instance, “were paid a percentage of\ntotal receipts in their area, the proportion varying from col-\nony to colony depending on the estimated potential yield.”\nT. Barrow, Trade and Empire: The British Customs Service\nin Colonial America 1660–1775, p. 14 (1967). Although the\ncustoms service in the Colonies later transitioned to a salary\nsystem, each customs “offcial was allowed certain fees for\nalmost every transaction.” Id., at 78. And, as to the postal\nservice, the Continental Congress allowed postmaster depu-\nties 20 percent “on the sums they collect and pay into the\nGeneral post offce annually,” up to $1,000, and 10 percent\non sums over that amount. 2 Journals of the Continental\nCongress, 1774–1789, p. 208 (W. Ford ed. 1905).\n   Postratifcation practice therefore confrms our interpreta-\ntion of the Appropriations Clause. Early appropriations\ndisplayed signifcant variety in their structure. Each, how-\never, adhered to the minimum requirements of an identifable\nsource of public funds and purpose.\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)             435\n\n                      Opinion of the Court\n\n                                B\n   The Bureau&#x27;s funding statute contains the requisite fea-\ntures of a congressional appropriation. The statute author-\nizes the Bureau to draw public funds from a particular\nsource—“the combined earnings of the Federal Reserve Sys-\ntem,” in an amount not exceeding an infation-adjusted cap.\n</pre><span class=\"citation no-link\">12 U. S. C. §§ 5497</span><pre class=\"inline\">(a)(1), (2)(A)–(B). And, it specifes the ob-\njects for which the Bureau can use those funds—to “pay the\nexpenses of the Bureau in carrying out its duties and respon-\nsibilities.” § 5497(c)(1).\n   Further, the Bureau&#x27;s funding mechanism fts comfortably\nwith the First Congress&#x27; appropriations practice. In design,\nthe Bureau&#x27;s authorization to draw an amount that the Direc-\ntor deems reasonably necessary to carry out the agency&#x27;s\nresponsibilities, subject to a cap, is similar to the First Con-\ngress&#x27; lump-sum appropriations. And, the commission- and\nfee-based appropriations that supplied the Customs Service\nPage Proof Pending Publication\nand Post Offce provided standing authorizations to expend\npublic money in the same way that the Bureau&#x27;s funding\nmechanism does.\n   For these reasons, we conclude that the statute that au-\nthorizes the Bureau to draw funds from the combined earn-\nings of the Federal Reserve System is an “Appropriatio[n]\nmade by Law.” We therefore hold that the requirements of\nthe Appropriations Clause are satisfed.\n\n                               III\n  The associations make three principal arguments for why\nthe Bureau&#x27;s funding mechanism violates the Appropriations\nClause, each of which attempts to build additional require-\nments into the meaning of an “Appropriatio[n] made by\nLaw.” None is persuasive.\n\n                                A\n  At the outset, the associations argue that the Bureau&#x27;s\nfunding is not “drawn . . . in Consequence of Appropriations\n\f436 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                   Opinion of the Court\n\nmade by Law” because the agency, rather than Congress,\ndecides the amount of annual funding that it draws from the\nFederal Reserve System. This argument proceeds from a\nmistaken premise. Congress determined the amount of the\nBureau&#x27;s annual funding by imposing a statutory cap. The\nBureau&#x27;s funding statute provides that “the amount that\nshall be transferred to the Bureau in each fscal year shall\nnot exceed” 12 percent “of the total operating expenses of\nthe Federal Reserve System” as reported in 2009 and ad-\njusted for infation. § 5497(a)(2). The only sense in which\nthe Bureau decides its own funding, then, is by exercising its\ndiscretion to draw less than the statutory cap. But, as we\nhave explained, “sums not exceeding” appropriations, which\nprovided the Executive with the same discretion, were com-\nmonplace immediately after the founding. Supra, at 432–\n433. Thus, we cannot conclude that Congress violated the\nAppropriations Clause by permitting the Bureau to decide\nhow much funding to draw up to a cap.\nPage Proof Pending Publication\n                               B\n   Next, the associations suggest that the Bureau&#x27;s funding\nstatute is not a valid appropriation because it is not time\nlimited. On their reading, the Appropriations Clause re-\nquires both Chambers of Congress to periodically agree on\nan agency&#x27;s funding, which ensures that each Chamber re-\nserves the power to unilaterally block those funding meas-\nures through inaction. The Bureau&#x27;s funding mechanism,\nthe associations insist, inverts this baseline by allowing it to\ndraw funds—forever—unless both Chambers of Congress\nstep in and affrmatively prevent the agency from doing so.\n   But, the Constitution&#x27;s text suggests that, at least in some\ncircumstances, Congress can make standing appropriations.\nThe Constitution expressly provides that “no Appropriation\nof Money” to support an army “shall be for a longer Term\nthan two Years.” Art. I, § 8, cl. 12. Hamilton explained\nthat this restriction ensures that, for the army, Congress\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)             437\n\n                      Opinion of the Court\n\ncannot “vest in the Executive department . . . permanent\nfunds” and must instead “once at least in every two years\n. . . deliberate upon the propriety of keeping a military force\non foot,” “come to a new resolution on the point,” and “de-\nclare their sense of the matter, by a formal vote in the face\nof their constituents.” The Federalist No. 26, p. 143 (E.\nScott ed. 1898). The Framers were thus aware of the dy-\nnamic that the associations highlight, but they did not explic-\nitly limit the duration of appropriations for other purposes.\n    The First Congress&#x27; practice confrms this understanding.\nRecall that the appropriations that supplied funding to the\nCustoms Service and the Post Offce were not time limited.\nSupra, at 433–434. The associations resist the analogy to\nthe Post Offce and other fee-based agencies, arguing that\nsuch agencies do not enjoy the same level of fscal independ-\nence as the Bureau. Fee-based agencies, the associations\nreason, “could not demand funds from the federal fsc, but\nrather needed to persuade the people they served to pay\nPage Proof Pending Publication\nthem, and the public could refuse to purchase to infuence\ntheir conduct.” Brief for Respondents 35. The associa-\ntions, however, make no attempt to explain why the possibil-\nity that the public&#x27;s choices could restrain fee-based agencies&#x27;\nrevenue is relevant to the question whether a law complies\nwith the constitutional imperative that there be an\nappropriation.\n                                C\n   Finally, the associations contend that the Bureau&#x27;s funding\nmechanism provides a blueprint for destroying the separa-\ntion of powers, and that it invites tyranny by allowing the\nExecutive to operate free of any meaningful fscal check. If\nthe Bureau&#x27;s funding mechanism is consistent with the Ap-\npropriations Clause, the associations reason, then Congress\ncould do the same for any—or every—civilian executive\nagency. And that, they conclude, would be the very unifca-\ntion of the sword and purse that the Appropriations Clause\nforbids.\n\f438 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                   Opinion of the Court\n\n   The associations err by reducing the power of the purse to\nonly the principle expressed in the Appropriations Clause.\nTo be sure, the Appropriations Clause presupposes Con-\ngress&#x27; powers over the purse. But, its phrasing and location\nin the Constitution make clear that it is not itself the source\nof those powers. The Appropriations Clause is phrased as\na limitation: “No Money shall be drawn from the Treasury,\nbut in Consequence of Appropriations made by Law.” Art.\nI, § 9. And, it is placed within a section of other such limita-\ntions. Compare ibid. (“No Bill of Attainder or ex post facto\nLaw shall be passed”) and ibid. (“No Tax or Duty shall be\nlaid on Articles exported from any State”), with § 8 (“The\nCongress shall have Power To . . . ”). The associations offer\nno defensible argument that the Appropriations Clause re-\nquires more than a law that authorizes the disbursement of\nspecifed funds for identifed purposes. Without such a the-\nory, the associations&#x27; Appropriations Clause challenge must\nfail. See Haaland v. Brackeen, </pre><span class=\"citation\" data-id=\"10516275\"><a href=\"/opinion/10049675/haaland-v-brackeen/\" aria-description=\"Citation for case: Haaland v. Brackeen\">599 U. S. 255</a></span><pre class=\"inline\">, 277–278 (2023).\nPage Proof Pending Publication\n                              IV\n  The dissent&#x27;s theory fares no better. The dissent accepts\nthat the question in this case is ultimately about the meaning\nof “Appropriations.” Post, at 452. It faults us for consult-\ning dictionaries to ascertain the original public meaning of\nthat word, insisting instead that “Appropriations” is a “term\nof art whose meaning has been feshed out by centuries of\nhistory.” </pre><span class=\"citation\" data-id=\"10516275\"><a href=\"/opinion/10049675/haaland-v-brackeen/\" aria-description=\"Citation for case: Haaland v. Brackeen\">Ibid.</a></span><pre class=\"inline\"> But, as we have explained at length, both\npreratifcation and postratifcation appropriations practice\nsupport our source-and-purpose understanding. Supra, at\n427–434. What is more, the dissent never offers a compet-\ning understanding of what the word “Appropriations” means.\nAfter winding its way through English, Colonial, and early\nAmerican history about the struggle for popular control of\nthe purse, the dissent declares that “the Appropriations\nClause demands legislative control over the source and dis-\nposition of the money used to fnance Government operations\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)             439\n\n                      Opinion of the Court\n\nand projects.” Post, at 463. The dissent never connects its\nsummary of history back to the word “Appropriations.”\nAnd, even setting that problem aside, it is unclear why the\ndissent&#x27;s theory leads to a different outcome: Congress con-\ntrols the “source and disposition of the money used to fnance\nGovernment operations and projects” by enacting a law that\nidentifes the source of public funds and authorizes the ex-\npenditure of those funds for designated purposes.\n   The dissent&#x27;s rendition of history largely ignores the his-\ntorical evidence that bears most directly on the meaning of\n“Appropriations” at the founding—preratifcation appropria-\ntions laws. For example, the dissent spends pages recount-\ning how Parliament secured fscal supremacy and wielded\nthat power to superintend the King. See post, at 453–458.\nAlthough that history is a helpful starting point, see supra,\nat 427–428, it at most explains why appropriations must be\n“made by Law”—not what it means for the legislature to\nPage Proof Pending Publication\nmake an “Appropriation.” The dissent does not meaning-\nfully grapple with the many parliamentary appropriations\nlaws that preserved a broad range of fscal discretion for the\nKing. See supra, at 428–430. It makes no attempt to ex-\nplain “sums not exceeding” appropriations. See ibid. And,\nthe dissent brushes aside the civil list, asserting that it\n“ `presented a constitutional problem in the confict between\nthe principle of the independence of the Crown and the prin-\nciple of parliamentary control of fnance.&#x27; ” Post, at 458\n(quoting Reitan 320). The problem was that the King\nclaimed absolute power to use the sums granted in the civil\nlist as he pleased and regularly spent in excess of the allotted\namount. See id., at 320, 324–329. But, the dissent never\nexplains why the reforms that Parliament adopted in re-\nsponse to these abuses bear on whether the law establishing\nthe civil list was an “appropriation.”\n   The dissent&#x27;s treatment of early American history does not\nadvance its point either. It highlights the undisputed point\nthat colonial and state legislative bodies exercised the\n\f440 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                   Opinion of the Court\n\npower of the purse, post, at 459–460, while sidestepping the\ndiscretionary and open-ended appropriations they enacted,\nsupra, at 430–431. The dissent quibbles with the open-\nended appropriations laws that we rely on, speculating that\nstate constitutions somehow constrained the breadth of those\nlaws. Post, at 463, n. 13. But, the dissent never explains\nhow these constitutional provisions informed what it meant\nfor state legislative bodies to make an “appropriation” and,\nin any event, its critique misses the point: It was common-\nplace for preratifcation appropriations laws to be open-\nended in a way that is not consistent with the specifcity that\nthe dissent&#x27;s theory appears to require.\n   When the dissent turns to postratifcation history, it en-\ngages with several appropriations laws enacted by the First\nCongress. The dissent acknowledges, as it must, that the\nfee- and commission-based funding schemes for the Customs\nService and Post Offce show that Congress exercised broad\nPage Proof Pending Publication\ndiscretion over how to appropriate money. Post, at 461–462.\nTo square these funding schemes with its understanding of\nthe Appropriations Clause, the dissent points out that Con-\ngress required “fees in excess of what was needed to defray\nthe cost of providing services be turned over to the Treas-\nury.” Post, at 462. This requirement, the dissent reasons,\n“ensured that Congress maintained control over the pur-\nposes for which [the appropriated] money was spent.” Ibid.\nBut, if what matters is that Congress controls how funds are\nspent, then we are all in agreement—appropriations must\ndesignate the purposes for which money can be spent.\n   Even under the dissent&#x27;s “legislative control” theory, its\nattempt to distinguish the Customs Service and the Post Of-\nfce from the Bureau is not convincing. The dissent points\nout that Congress had control over the Customs Service, for\ninstance, because Customs had a “carefully delineated mis-\nsion” and “early tariff Acts spelled out in excruciating detail\nthe various fees” customs offcers could collect, as well as the\nsalaries the offcers could be paid from those receipts. Post,\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)             441\n\n                      Kagan, J., concurring\n\nat 466. According to the dissent, the Bureau is different be-\ncause “[i]ts powers are broad and vast,” “[i]t does not collect\nfees,” and “it is permitted to keep and invest surplus funds.”\n</pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">Ibid.</a></span><pre class=\"inline\"> But, it is unclear why these differences matter under\nthe dissent&#x27;s theory. After all, to make a valid appropria-\ntion, Congress must designate the objects for which the ap-\npropriated funds may be used—as it did here. See </pre><span class=\"citation no-link\">12\nU. S. C. § 5497</span><pre class=\"inline\">(c)(1). Although there may be other constitu-\ntional checks on Congress&#x27; authority to create and fund an\nadministrative agency, specifying the source and purpose is\nall the control the Appropriations Clause requires.\n\n                                V\n  The statute that authorizes the Bureau to draw money\nfrom the combined earnings of the Federal Reserve System\nto carry out its duties satisfes the Appropriations Clause.\nAccordingly, we reverse the judgment of the Court of Ap-\nPage Proof Pending Publication\npeals and remand the case for further proceedings consistent\nwith this opinion.\n                                            It is so ordered.\n\n  Justice Kagan, with whom Justice Sotomayor, Jus-\ntice Kavanaugh, and Justice Barrett join, concurring.\n   I join in full the Court&#x27;s opinion holding that the funding\nmechanism for the Consumer Financial Protection Bureau\ncomplies with the Appropriations Clause. As the Court de-\ntails, that conclusion emerges from the Clause&#x27;s “text, the his-\ntory against which that text was enacted, and congressional\npractice immediately following ratifcation.” Ante, at 426.\nAt its inception, the Clause required only that Congress\n“identify a source of public funds and authorize the expendi-\nture of those funds for designated purposes.” </pre><span class=\"citation no-link\">Ibid.</span><pre class=\"inline\"> The\nClause otherwise granted Congress “a wide range of discre-\ntion.” Ante, at 431. The result was “signifcant variety” in\nappropriations—most notably, as to their specifcity, dura-\ntion, and funding source. Ante, at 434; see ante, at 432–434.\n\f442 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                  Kagan, J., concurring\n\nThe CFPB&#x27;s funding scheme, if transplanted back to the late-\n18th century, would have ft right in.\n   I write separately to note that the same would have been\ntrue at any other time in our Nation&#x27;s history. “ `Long set-\ntled and established practice&#x27; may have `great weight&#x27; ” in\ninterpreting constitutional provisions about the operation of\ngovernment. Chiafalo v. Washington, </pre><span class=\"citation no-link\">591 U. S. 578</span><pre class=\"inline\">, 592–\n593 (2020) (quoting The Pocket Veto Case, </pre><span class=\"citation\" data-id=\"101447\"><a href=\"/opinion/101447/the-pocket-veto-case/#689\" aria-description=\"Citation for case: The Pocket Veto Case\">279 U. S. 655, 689</a></span><pre class=\"inline\">\n(1929)); see also The Federalist No. 37, p. 229 (C. Rossiter ed.\n1961). And here just such a tradition supports everything\nthe Court says about the Appropriations Clause&#x27;s meaning.\nThe founding-era practice that the Court relates became the\n19th-century practice, which became the 20th-century prac-\ntice, which became today&#x27;s. For over 200 years now, Con-\ngress has exercised broad discretion in crafting appropria-\ntions. Sometimes it has authorized the expenditure of a\nsum certain for an itemized purpose on an annual basis.\nPage Proof Pending Publication\nAnd sometimes it has departed from that model in one or\nmore ways. All the fexibility and diversity evident in the\nfounding period has thus continued unabated, making it ever\nmore obvious that the CFPB&#x27;s funding accords with the\nConstitution.\n   For one thing, Congress has never thought it necessary to\ndesignate specifc amounts for specifc items. Over the\nyears, many appropriations have instead given the Execu-\ntive leeway to decide how to allocate funds, up to a ceiling,\namong a set of activities. As the Court shows, the First\nCongress made appropriations of “sums not exceeding ”\nstated amounts for “broad categories” of purposes; the Exec-\nutive then decided the level of funding it would use for all\nthings within a category. Ante, at 432. In instituting those\n“lump-sum grants,” the First Congress created a template\nfor later ones to follow. </pre><span class=\"citation\" data-id=\"101447\"><a href=\"/opinion/101447/the-pocket-veto-case/\" aria-description=\"Citation for case: The Pocket Veto Case\">Ibid.</a></span><pre class=\"inline\"> Examples of such grants\n“abound in our history.” Clinton v. City of New York, </pre><span class=\"citation\" data-id=\"9433692\"><a href=\"/opinion/118238/clinton-v-city-of-new-york/#467\" aria-description=\"Citation for case: Clinton v. City of New York\">524\nU. S. 417, 467</a></span><pre class=\"inline\"> (1998) (Scalia, J., concurring in part and dis-\nsenting in part). During the Civil War, Congress author-\n\f                      Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)                 443\n\n                         Kagan, J., concurring\n\nized the allocation of $76.5 million for various expenses “as\nthe exigencies of the [Army] may require.” Act of Feb. 25,\n1862, ch. 32, 12 Stat. 344–345. In the Depression, Congress\nmade $950 million available “for such projects and/or pur-\nposes” as the President “in his discretion may prescribe.”\nAct of Feb. 15, 1934, ch. 13, </pre><span class=\"citation no-link\">48 Stat. 351</span><pre class=\"inline\">. More recent exam-\nples include an appropriation not to exceed $135 million for\nuses that the Secretaries of Defense and Energy determine\nare “necessary for Atomic Energy Defense Activities.” Act\nof Nov. 29, 1989, § 1605(a), </pre><span class=\"citation no-link\">103 Stat. 1598</span><pre class=\"inline\">. The constitution-\nality of such measures, Justice Scalia observed, “has never\nseriously been questioned”—in part because of their preva-\nlence. Clinton, </pre><span class=\"citation\" data-id=\"9433692\"><a href=\"/opinion/118238/clinton-v-city-of-new-york/#467\" aria-description=\"Citation for case: Clinton v. City of New York\">524 U. S., at 467</a></span><pre class=\"inline\">. Our government practice\nhas been “replete with instances of general appropriations”\nto be “expended as directed by designated government agen-\ncies.” Cincinnati Soap Co. v. United States, </pre><span class=\"citation\" data-id=\"102824\"><a href=\"/opinion/102824/cincinnati-soap-co-v-united-states/#322\" aria-description=\"Citation for case: Cincinnati Soap Co. v. United States\">301 U. S. 308,\n322</a></span><pre class=\"inline\"> (1937). The CFPB&#x27;s authority to take and allocate mon-\neys up to a statutory cap is just one more instance to add to\nPage Proof Pending Publication\nthe list.\n   Similarly, Congress has never thought appropriations\nmust be annual, or even time-limited. (Appropriations that\nare time-limited themselves show variety: Most are annual,\nbut some last for longer periods—say, two or fve years.*)\n“Standing ” appropriations—those making funds “always\navailable for specifed purposes” without “requir[ing] re-\npeated [legislative] action”—have a long history. GAO, Prin-\nciples of Federal Appropriations Law, p. 2–10 (rev. 4th ed.\n2016). As the Court notes, the First Congress, by setting up\nfee-based schemes, provided the Customs Service and Post\nOffce with indefnite funding. See ante, at 433–434, 437.\nAnd in doing so, that Congress again inspired its succes-\nsors. Standing appropriations proliferated during the 19th\n\n  *See, e. g., Foreign Operations, Export Financing, and Related Pro-\ngrams Appropriations Act, 2001, § 101(a), </pre><span class=\"citation no-link\">114 Stat. 1900</span><pre class=\"inline\"> et seq. (2-year\nappropriations); Military Construction Appropriations Act of 1986, </pre><span class=\"citation no-link\">99\nStat. 1024</span><pre class=\"inline\"> (5-year appropriations).\n\f444 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                  Kagan, J., concurring\n\ncentury; by 1880, 138 statutes making them were on the\nbooks. See S. Rep. No. 334, 46th Cong., 2d Sess., 4–7 (1880)\n(listing statutes). And the growth has not stopped: By Fis-\ncal Year 2022, spending that does not require periodic appro-\npriations (whether annual or longer) accounted for nearly\ntwo-thirds of the federal budget. See Congressional Budget\nOffce, The Accuracy of CBO&#x27;s Budget Projections for Fiscal\nYear 2022, p. 3 (Jan. 2023). Frequently, too, standing ap-\npropriations do not designate specifc sums of money, thus\ncombining one type of fexibility with another. They in-\nstead may provide the sums “necessary for purposes of ” a\nprogram—such as to provide unemployment assistance or\ngive scholarships to veterans&#x27; dependents. </pre><span class=\"citation no-link\">15 U. S. C.\n§ 9023</span><pre class=\"inline\">(d)(3); see 20 U. S. C. § 1070h(f). So again, Congress&#x27;s\nnon-time-limited grant to the CFPB for amounts (up to a\ncap) “reasonably necessary to carry out” its duties falls\nwithin an established tradition. </pre><span class=\"citation no-link\">12 U. S. C. § 5497</span><pre class=\"inline\">(a).\nPage Proof Pending Publication\n   And “fexible approaches to appropriations” have been\nparticularly common in the sphere of fnancial regulation.\nAnte, at 433. There, Congress&#x27;s adoption of assessment-\nbased funding mechanisms (similar to those the First Con-\ngress used for the Customs Service and Post Offce, see\nsupra, at 443) has meant that regulators do not have to seek\nyearly legislative funding. And they generally may devote\nthe funds they collect to any of a range of activities. For\nexample, the Offce of the Comptroller of the Currency has\nauthority to levy assessments on banks as “necessary or ap-\npropriate to carry out [its] responsibilities.” </pre><span class=\"citation no-link\">12 U. S. C. § 16</span><pre class=\"inline\">;\nsee also Act of Feb. 19, 1875, ch. 89, </pre><span class=\"citation no-link\">18 Stat. 329</span><pre class=\"inline\">. Similarly,\nthe Federal Reserve Board assesses Federal Reserve Banks\nfor whatever amount is “suffcient to pay its estimated ex-\npenses.” </pre><span class=\"citation no-link\">12 U. S. C. § 243</span><pre class=\"inline\">; see also Federal Reserve Act, </pre><span class=\"citation no-link\">38\nStat. 261</span><pre class=\"inline\"> (1913). Indeed, not a single federal bank regulator\nis currently, or has been for a long while, funded by standard\ncongressional appropriations. The CFPB received from\nthose regulators most of the powers it wields today. So it\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)            445\n\n                     Jackson, J., concurring\n\nis not surprising that the CFPB also inherited a bank-funded\nscheme enabling it to allocate moneys, at its own discretion,\nto carry out its responsibilities.\n   I would therefore add one more point to the Court&#x27;s opin-\nion. As the Court describes, the Appropriations Clause&#x27;s text\nand founding-era history support the constitutionality of the\nCFPB&#x27;s funding. See ante, at 426. And so too does a con-\ntinuing tradition. Throughout our history, Congress has\ncreated a variety of mechanisms to pay for government oper-\nations. Some schemes specifed amounts to go to designated\nitems; others left greater discretion to the Executive. Some\nwere limited in duration; others were permanent. Some re-\nlied on general Treasury moneys; others designated alterna-\ntive sources of funds. Whether or not the CFPB&#x27;s mecha-\nnism has an exact replica, its essentials are nothing new.\nAnd it was devised more than two centuries into an unbro-\nken congressional practice, beginning at the beginning, of\ninnovation and adaptation in appropriating funds. The way\nPage Proof Pending Publication\nour Government has actually worked, over our entire experi-\nence, thus provides another reason to uphold Congress&#x27;s deci-\nsion about how to fund the CFPB.\n\n  Justice Jackson, concurring.\n   Today, the Court correctly concludes that, based on the\nplain meaning of the text of the Appropriations Clause, “an\nappropriation is simply a law that authorizes expenditures\nfrom a specifed source of public money for designated pur-\nposes.” Ante, at 424. The statute that Congress passed to\nfund the Consumer Financial Protection Bureau easily meets\nthe Appropriations Clause&#x27;s minimal requirements. See\nante, at 435. It authorizes the Bureau to withdraw money\nfrom “the combined earnings of the Federal Reserve Sys-\ntem,” </pre><span class=\"citation no-link\">12 U. S. C. § 5497</span><pre class=\"inline\">(a)(1), in order “to pay the expenses\nof the Bureau in carrying out its duties and responsibilities,”\n§ 5497(c)(1). In my view, nothing more is needed to decide\nthis case.\n\f446 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD\n                  Jackson, J., concurring\n\n   Indeed, there are good reasons to go no further. When\nthe Constitution&#x27;s text does not provide a limit to a coordi-\nnate branch&#x27;s power, we should not lightly assume that Arti-\ncle III implicitly directs the Judiciary to fnd one. The Con-\nstitution was “intended to endure for ages to come, and,\nconsequently, to be adapted to the various crises of human\naffairs.” McCulloch v. Maryland, </pre><span class=\"citation\" data-id=\"85272\"><a href=\"/opinion/85272/mculloch-v-state-of-maryland/#415\" aria-description=\"Citation for case: M&#x27;culloch v. State of Maryland\">4 Wheat. 316, 415</a></span><pre class=\"inline\"> (1819)\n(emphasis deleted). An essential aspect of the Constitu-\ntion&#x27;s endurance is that it empowers the political branches to\naddress new challenges by enacting new laws and policies—\nwithout undue interference by courts. To that end, we have\nmade clear in cases too numerous to count that nothing in the\nConstitution gives federal courts “ `some amorphous general\nsupervision of the operations of government.&#x27; ” Raines v.\nByrd, </pre><span class=\"citation\" data-id=\"9433528\"><a href=\"/opinion/118146/raines-v-byrd/#829\" aria-description=\"Citation for case: Raines v. Byrd\">521 U. S. 811, 829</a></span><pre class=\"inline\"> (1997) (quoting United States v.\nRichardson, </pre><span class=\"citation\" data-id=\"9425798\"><a href=\"/opinion/109086/united-states-v-richardson/#192\" aria-description=\"Citation for case: United States v. Richardson\">418 U. S. 166, 192</a></span><pre class=\"inline\"> (1974) (Powell, J., concur-\nring)). Put another way, the principle of separation of pow-\nPage Proof Pending Publication\ners manifested in the Constitution&#x27;s text applies with just as\nmuch force to the Judiciary as it does to Congress and the\nExecutive. See Public Workers v. Mitchell, </pre><span class=\"citation\" data-id=\"9419928\"><a href=\"/opinion/104374/united-public-workers-of-america-v-mitchell/\" aria-description=\"Citation for case: United Public Workers of America v. Mitchell\">330 U. S. 75</a></span><pre class=\"inline\">,\n90–91 (1947).\n   This case illustrates why. As the Court explains, in re-\nsponse to the devastation wrought by the 2008 fnancial cri-\nsis, Congress passed and the President signed the Dodd-\nFrank Wall Street Reform and Consumer Protection Act.\nSee ante, at 421. In that statute, Congress chose to fund the\nBureau outside of the annual appropriations process. See\nante, at 422. Drawing on its extensive experience in fnancial\nregulation, Congress designed the funding scheme to protect\nthe Bureau from the risk that powerful regulated entities\nmight capture the annual appropriations process. See, e.g.,\nS. Rep. No. 111–176, pp. 162–164 (2010); A. Levitin, The Poli-\ntics of Financial Regulation and the Regulation of Financial\nPolitics, </pre><span class=\"citation no-link\">127 Harv. L. Rev. 1991</span><pre class=\"inline\">, 2056–2058 (2014); R. Barkow,\nInsulating Agencies, 89 Texas L. Rev. 15, 42–45, 67, 77 (2010);\nsee also ante, at 444 (Kagan, J., concurring) (describing long\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)           447\n\n                       Alito, J., dissenting\n\nhistory of congressional fexibility in designing funding\nschemes for fnancial regulators).\n   Respondents, two associations of payday lenders, repre-\nsent exactly the type of entity the Bureau&#x27;s progenitors\nsought to regulate and whose infuence Congress may have\nfeared. See O. Bar-Gill &amp; E. Warren, Making Credit Safer,\n</pre><span class=\"citation no-link\">157 U. Pa. L. Rev. 1</span><pre class=\"inline\">, 44–45, 55–59, 68–70 (2008). In urging\nus to fnd the Bureau&#x27;s funding scheme unconstitutional,\nthen, respondents would not only have us fnd unstated limits\nin the Constitution&#x27;s text, they would have us undercut the\nconsidered judgments of a coordinate branch about how to\nrespond to a pressing national concern.\n   Of course, to say that Congress had reasons for designing\nthe Bureau&#x27;s funding scheme in the manner it did is not to\nendorse those policy choices. “With the wisdom of the pol-\nicy adopted, with the adequacy or practicability of the law\nenacted to forward it, the courts are both incompetent and\nunauthorized to deal.” Nebbia v. New York, </pre><span class=\"citation\" data-id=\"102224\"><a href=\"/opinion/102224/nebbia-v-new-york/\" aria-description=\"Citation for case: Nebbia v. New York\">291 U. S. 502</a></span><pre class=\"inline\">,\nPage Proof Pending Publication\n537 (1934). Instead, the Constitution places primary re-\nsponsibility for checking the political branches with the Peo-\nple. See King v. Burwell, </pre><span class=\"citation\" data-id=\"2811845\"><a href=\"/opinion/2811845/king-v-burwell/#498\" aria-description=\"Citation for case: King v. Burwell\">576 U. S. 473, 498</a></span><pre class=\"inline\"> (2015) (“In a\ndemocracy, the power to make the law rests with those cho-\nsen by the people”). It is to them that the Court rightly\nreturns any remaining policy questions posed by today&#x27;s\ncase.\n\n  Justice Alito, with whom Justice Gorsuch joins,\ndissenting.\n  Since the earliest days of our Republic, Congress&#x27;s “power\nover the purse” has been its “most complete and effectual\nweapon” to ensure that the other branches do not exceed\nor abuse their authority. The Federalist No. 58, p. 359\n(C. Rossiter ed. 1961) (J. Madison). The Appropriations\nClause protects this power by providing that “[n]o Money\nshall be drawn from the Treasury, but in Consequence of\nAppropriations made by Law.” Art. I, § 9, cl. 7. This pro-\n\f448 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD.\n                   Alito, J., dissenting\n\nvision has a rich history extending back centuries before the\nfounding of our country. Its aim is to ensure that the peo-\nple&#x27;s elected representatives monitor and control the expend-\niture of public funds and the projects they fnance, and it\nimposes on Congress an important duty that it cannot sign\naway. “Any other course” would give the Executive “a most\ndangerous discretion.” Reeside v. Walker, </pre><span class=\"citation\" data-id=\"86644\"><a href=\"/opinion/86644/reeside-v-walker/#291\" aria-description=\"Citation for case: Reeside v. Walker\">11 How. 272,\n291</a></span><pre class=\"inline\"> (1851).\n   Unfortunately, today&#x27;s decision turns the Appropriations\nClause into a minor vestige. The Court upholds a novel\nstatutory scheme under which the powerful Consumer Fi-\nnancial Protection Bureau (CFPB) may bankroll its own\nagenda without any congressional control or oversight. Ac-\ncording to the Court, all that the Appropriations Clause de-\nmands is that Congress “identify a source of public funds\nand authorize the expenditure of those funds for designated\npurposes.” Ante, at 426. Under this interpretation, the\nPage Proof Pending Publication\nClause imposes no temporal limit that would prevent Con-\ngress from authorizing the Executive to spend public funds\nin perpetuity. Contra, Montesquieu, The Spirit of the Laws,\nbk. XI, ch. VI, p. 160 (O. Piest ed., T. Nugent transl. 1949)\n(warning that a legislature will lose its power of the purse if\nit passes an appropriation that lasts “forever”). Nor does\nthe Court&#x27;s interpretation require Congress to set an upper\nlimit on the amount of money that the Executive may take.\nToday&#x27;s decision does not even demand that an agency&#x27;s\nfunds come from the Treasury. As the Solicitor General ad-\nmitted at argument, under this interpretation, the Appropri-\nations Clause would permit an agency to be funded entirely\nby private sources. Tr. of Oral Arg. 34–35. In short, there\nis apparently nothing wrong with a law that empowers the\nExecutive to draw as much money as it wants from any iden-\ntifed source for any permissible purpose until the end of\ntime.\n   That is not what the Appropriations Clause was under-\nstood to mean when it was adopted. In England, Parlia-\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)           449\n\n                       Alito, J., dissenting\n\nment had won the power over the purse only after centuries\nof struggle with the Crown. Steeped in English constitu-\ntional history, the Framers placed the Appropriations Clause\nin the Constitution to protect this hard-won legislative\npower.\n                              I\n   In the 2010 Dodd-Frank Wall Street Reform and Con-\nsumer Protection Act, Congress created the CFPB, an inde-\npendent regulatory agency with “vast rulemaking, enforce-\nment, and adjudicatory authority over a signifcant portion of\nthe U. S. economy.” Seila Law LLC v. Consumer Financial\nProtection Bureau, </pre><span class=\"citation no-link\">591 U. S. 197</span><pre class=\"inline\">, 203 (2020); see </pre><span class=\"citation no-link\">id., at 222,\nn. 8</span><pre class=\"inline\">. And in designing the CFPB, “Congress deviated from\nthe structure of nearly every other independent administra-\ntive agency in our history.” </pre><span class=\"citation no-link\">Id., at 203</span><pre class=\"inline\">. At every turn, the\nstatute attempted to insulate the CFPB from control by any\noffcial answerable to the people. First, “Congress provided\nPage Proof Pending Publication\nthat the CFPB would be led by a single Director, who serves\nfor a longer term than the President,” and Congress at-\ntempted to protect the Director from removal by the Presi-\ndent “except for ineffciency, neglect, or malfeasance.” </pre><span class=\"citation no-link\">Ibid.</span><pre class=\"inline\">\nIn Seila Law, we struck down this restriction because it\nplaced “potent” power in the hands of an offcial who was\n“neither elected by the people nor meaningfully controlled\n. . . by someone who is.” </pre><span class=\"citation no-link\">Id., at 206</span><pre class=\"inline\">, 224–225.\n   Elected in the atmosphere that followed the fnancial crisis\nof 2008, the Congress that created the CFPB also sought to\nfree the CFPB from supervision by subsequent Congresses\nthat might wish to superintend the Bureau&#x27;s exercise of its\nvast powers. To achieve that end, the CFPB was given an\nunprecedented way of obtaining funds that was expressly\ndesigned to make it totally “independent of the Congres-\nsional appropriations process.” S. Rep. No. 111–176, p. 163\n(2010).\n   Under that scheme, the CFPB is not funded by appropria-\ntions enacted by Congress. Instead, each year, the CFPB\n\f450 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD.\n                   Alito, J., dissenting\n\nDirector tells the Federal Reserve Board of Governors how\nmuch money it thinks is “reasonably necessary” to carry out\nthe CFPB&#x27;s operations. </pre><span class=\"citation no-link\">12 U. S. C. § 5497</span><pre class=\"inline\">(a)(1). So long as\nthis amount does not exceed 12% of the Federal Reserve\nSystem&#x27;s total operating expenses, the Board of Governors\nmust comply with that demand and hand over the specifed\nsum “from the combined earnings of the Federal Reserve\nSystem.” §§ 5497(a)(1), (2)(A). These earnings come from\nthe Federal Reserve Banks, which are federally chartered\ncorporations that are “not departments of the government.”\nEmergency Fleet Corp. v. Western Union Telegraph Co., </pre><span class=\"citation\" data-id=\"101189\"><a href=\"/opinion/101189/emergency-fleet-corp-v-western-union-telegraph-co/#426\" aria-description=\"Citation for case: Emergency Fleet Corp. v. Western Union Telegraph Co.\">275\nU. S. 415, 426</a></span><pre class=\"inline\"> (1928); see § 341.1 The Federal Reserve\nBanks&#x27; earnings represent interest on and gains derived\nfrom the purchase and sale of securities, as well as fees they\nreceive for services provided to depository institutions,\n“such as check clearing, funds transfers, and automated\nclearinghouse operations.” United States Federal Reserve\nSystem, The Fed Explained: What the Central Bank Does 4\nPage Proof Pending Publication\n(11th ed. 2021); see also Brief for Petitioners 23. At present,\nthe CFPB&#x27;s maximum annual draw is nearly $750 million.2\n   In addition, the CFPB, unlike most agencies, does not have\nto return any unspent funds to the Treasury. </pre><span class=\"citation no-link\">12 U. S. C.\n§ 5497</span><pre class=\"inline\">(b). Instead, the CFPB may invest or roll over any\nunspent money into a separate fund, which it may use in the\nfuture “to pay the expenses of the [CFPB] in carrying out\nits duties and responsibilities.” §§ 5497(b)–(c).3 As of Sep-\n  1\n     Each Federal Reserve Bank has a Board of nine Directors—six are\nelected by private member banks, and three are appointed by the Federal\nReserve System&#x27;s Board of Governors. </pre><span class=\"citation no-link\">12 U. S. C. §§ 302</span><pre class=\"inline\">, 304.\n   2\n     In the most recent fscal year, the Bureau requested $641.5 million of\nits then-applicable $734 million limit. Financial Report of the Consumer\nFinancial Protection Bureau: Fiscal Year 2022, pp. 44–45 (Nov. 15, 2022)\n(2022 Report) (online source archived at https://www.supremecourt.gov).\n   3\n     The CFPB invests these funds in 3-month Treasury bills, from which\nit receives an annualized return of 5%. See Board of Governors of the\nFederal Reserve System, 3-Month Treasury Bill Secondary Market Rate,\n\f                       Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)                   451\n\n                           Alito, J., dissenting\n\ntember 30, 2022, the CFPB had built up an endowment worth\nnearly $340 million. See 2022 Report, at 86.\n   In devising this novel scheme, Congress appears to have\nanticipated that it might be challenged under the Appropria-\ntions Clause, and Congress therefore attempted to shield\nits new creation by providing that “[f]unds obtained by or\ntransferred to the [CFPB] shall not be construed to be\nGovernment funds or appropriated monies.” 4 § 5497(c)(2).\nAnd to impede congressional oversight of the CFPB&#x27;s use of\nthis money, the Act added that the Bureau&#x27;s funds are not\n“subject to review by the Committees on Appropriations.”\n§ 5497(a)(2)(C).\n   The Framers would be shocked, even horrifed, by this\nscheme. Beginning with the First Congress, agencies5 were\ngenerally funded by annual appropriations from the Treas-\nury. K. Stith, Congress&#x27; Power of the Purse, 97 Yale L. J.\n1343, 1354, n. 53 (1988) (Stith). While there have been de-\nPage Proof Pending Publication\npartures from this dominant model, nothing like the CFPB&#x27;s\nfunding scheme has previously been seen. In the decision\nbelow, the Fifth Circuit held that the CFPB&#x27;s unparalleled\nfnancial independence violates the Appropriations Clause\nand “the constitutional separation of powers.” </pre><span class=\"citation no-link\">51 F. 4th 616</span><pre class=\"inline\">,\n642 (2022). Because I agree that the CFPB&#x27;s funding struc-\nture is unconstitutional, I would affrm the Fifth Circuit&#x27;s\njudgment.\n\nDiscount Basis, Economic Research: Federal Reserve Bank of St. Louis\n(Mar. 13, 2024), https://fred.stlouisfed.org/series/DTB3.\n  4\n    Congress obviously cannot evade the Appropriations Clause simply by\nplacing a different label on an authorization to obtain and spend money\nthat falls within the meaning of an “Appropriatio[n]” under that provision.\nAnd here, the Government argues that the statutory provision cited in the\ntext was not meant to have that effect, but was adopted for other pur-\nposes. See Tr. of Oral Arg. 20.\n  5\n    For want of a better term, I use the term “agency” to refer to any\ncomponent of the Executive Branch.\n\f452 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD.\n                   Alito, J., dissenting\n\n                              II\n                              A\n   The Appropriations Clause is found in Article I, § 9, clause\n7, of the Constitution, which provides:\n     “No Money shall be drawn from the Treasury, but in\n     Consequence of Appropriations made by Law; and a reg-\n     ular Statement and Account of the Receipts and Ex-\n     penditures of all public Money shall be published from\n     time to time.”\nThe frst part of this provision is customarily called the Ap-\npropriations Clause, and the second is referred to as the\nStatement and Account Clause.\n    The Appropriations Clause contains two key terms—\n“Money . . . drawn from the Treasury” and “Appropria-\ntions”—both of which require a little explanation. As the\nGovernment acknowledges, “Money . . . drawn from the\nTreasury” is synonymous with the term “public Money,” 6\nPage Proof Pending Publication\nwhich appears in the Statement and Account Clause. And\nin this case, it is undisputed that the funds requisitioned by\nthe CFPB constitute “public Money.” 7 Thus, the only re-\nmaining textual question is whether the CFPB gets its fund-\ning from “Appropriations” in the sense in which the Consti-\ntution uses that term.\n    The Court answers that question by consulting a few old\ndictionaries, which it says establish that “[i]n ordinary usage,\n. . . an appropriation of public money would be a law author-\nizing the expenditure of particular funds for specifed ends.”\nAnte, at 427. It accordingly concludes that the Appropria-\ntions Clause requires no more than a law, a fund, and a pur-\npose. Ante, at 426–427.\n    This analysis overlooks the fact that the term “Appropria-\ntions,” as used in the Constitution, is a term of art whose\nmeaning has been feshed out by centuries of history. To\n 6\n     See, e. g., Tr. of Oral Arg. 34; Stith 1357.\n 7\n     See, e. g., Tr. of Oral Arg. 19, 34.\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)            453\n\n                       Alito, J., dissenting\n\nbe sure, in interpreting the Constitution, we start with the\npresumption that “ `its words and phrases&#x27; ” carry their\n“ `normal and ordinary&#x27; ” meaning. District of Columbia v.\nHeller, </pre><span class=\"citation\" data-id=\"9435156\"><a href=\"/opinion/145777/district-of-columbia-v-heller/#576\" aria-description=\"Citation for case: District of Columbia v. Heller\">554 U. S. 570, 576</a></span><pre class=\"inline\"> (2008) (quoting United States v.\nSprague, </pre><span class=\"citation\" data-id=\"101684\"><a href=\"/opinion/101684/united-states-v-sprague/#731\" aria-description=\"Citation for case: United States v. Sprague\">282 U. S. 716, 731</a></span><pre class=\"inline\"> (1931)). But our analysis cannot\nend there. Some provisions use terms with specialized and\nwell-established meanings that we cannot use dictionaries to\nbrush aside. “ `[I]f a word is obviously transplanted from\nanother legal source, whether the common law or other legis-\nlation, it brings the old soil with it.&#x27; ” Sekhar v. United\nStates, </pre><span class=\"citation\" data-id=\"944097\"><a href=\"/opinion/944097/sekhar-v-united-states/#733\" aria-description=\"Citation for case: Sekhar v. United States\">570 U. S. 729, 733</a></span><pre class=\"inline\"> (2013); see also A. Scalia &amp; B. Gar-\nner, Reading Law: The Interpretation of Legal Texts 73–77\n(2012). Applied here, this rule means that the term “Appro-\npriatio[n]” should be interpreted in light of “legal tradition\nand . . . centuries of practice.” Morissette v. United States,\n</pre><span class=\"citation\" data-id=\"104952\"><a href=\"/opinion/104952/morissette-v-united-states/#263\" aria-description=\"Citation for case: Morissette v. United States\">342 U. S. 246, 263</a></span><pre class=\"inline\"> (1952). I therefore turn to that history.\n\n                                B\nPage Proof Pending\n              1    Publication\n   The delegates to the Constitutional Convention did not in-\nvent the appropriations requirement. Rather, that impor-\ntant safeguard arose from centuries of “British experience.”\nConsumer Financial Protection Bureau v. All Am. Check\nCashing, Inc., </pre><span class=\"citation no-link\">33 F. 4th 218</span><pre class=\"inline\">, 224 (CA5 2022) (en banc) (Jones,\nJ., concurring). The Framers were aware of the require-\nment&#x27;s deep roots and the critical role it had played in “the\nhistory of the British Constitution.” The Federalist No. 58,\nat 359. By steadily asserting the power to condition appro-\npriations, the House of Commons, originally “an infant and\nhumble representation of the people[,] gradually enlarg[ed]\nthe sphere of its activity and importance, and fnally re-\nduc[ed], as far as it seems to have wished, all the overgrown\nprerogatives of the other branches of the government.”\n</pre><span class=\"citation no-link\">Ibid.</span><pre class=\"inline\">\n   A short summary of this process illustrates the important\nrole of the appropriations requirement. During the Middle\n\f454 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD.\n                   Alito, J., dissenting\n\nAges, kings relied almost entirely on what was called “ordi-\nnary” revenue. F. Maitland, The Constitutional History of\nEngland 433 (1908) (reprint 1993) (Maitland). This included\nincome from lands owned by the Crown, customs duties, and\nfeudal dues. See 1 W. Blackstone, Commentaries on the\nLaws of England 281–306 (2d ed. 1766). Consequently,\nthere was little meaningful difference “between the national\nrevenue and the king&#x27;s private pocket-money.” Maitland\n433.\n   The Crown&#x27;s fnancial independence gave it the ability to\ngovern with little parliamentary interference. As Maitland\nputs it, “throughout the Middle Ages the king&#x27;s revenue had\nbeen in a very true sense the king&#x27;s revenue, and parliament\nhad but seldom attempted to give him orders as to what he\nshould do with it.” </pre><span class=\"citation no-link\">Id., at 309</span><pre class=\"inline\">. “Under the Tudors, parlia-\nment hardly dared to meddle with such matters.” </pre><span class=\"citation no-link\">Ibid.</span><pre class=\"inline\">\n   In the 17th century, however, this pattern began to change.\nPage Proof Pending Publication\n</pre><span class=\"citation no-link\">Id.,</span><pre class=\"inline\"> at 309–310. By that time, “the king&#x27;s ordinary revenues\nwere no longer even remotely suffcient to cover the normal\ncosts of royal governance,” and the heavy expenditures of\nJames I and Charles I exacerbated the problem. J. Chafetz,\nCongress&#x27;s Constitution 47 (2017) (Chafetz). Rather than\nseeking appropriations from Parliament, the early Stuart\nkings engaged in controversial efforts to obtain additional\nordinary income through the use of various royal “preroga-\ntive[s].” G. Smith, A Constitutional and Legal History of\nEngland 315 (1955) (Smith). Among other things, they uni-\nlaterally imposed duties on imports, stepped up the collec-\ntion of feudal dues, sold monopolies, and forced individuals\nto loan money on pain of imprisonment. See </pre><span class=\"citation no-link\">id., at 315, 318</span><pre class=\"inline\">.\n   These measures aroused opposition and, in any event, did\nnot yield suffcient funds. As a result, James I and Charles\nI periodically found it necessary to ask Parliament to impose\nnew taxes in order to obtain the funds they wanted. When\nthey did so, the Commons began to fex the power of the\npurse and to demand a measure of royal accountability. Dis-\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)            455\n\n                       Alito, J., dissenting\n\nputes between the Commons and the Stuart kings about the\npower of the purse played a pivotal role in the transition\nfrom royal to parliamentary fnancial supremacy.\n   A few incidents illustrate this dynamic. In 1621, the\npower of the purse played a central role in disputes between\nthe Crown and Parliament over religious, geopolitical, and\njudicial authority. For some months, Parliament ignored re-\nquests from James I for more tax revenue. T. Taswell-\nLangmead, English Constitutional History From the Teu-\ntonic Conquest to the Present Time 532 (3d ed. 1886)\n(Taswell-Langmead). Though Parliament fnally expressed\n“willing[ness] to grant a moderate subsidy,” it insisted “frst”\non redress for “grievances.” </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/#533\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">Id., at 533</a></span><pre class=\"inline\">; see also Smith 315–\n316. Parliament&#x27;s petition infuriated James I, who ulti-\nmately dissolved Parliament and sent several of its leaders—\nincluding Sir Matthew Hale—to the Tower of London.\nTaswell-Langmead 534, 536.\nPage Proof Pending Publication\n   Under Charles I, the situation worsened. At the begin-\nning of his reign, the Commons refused to grant him the\nlife-time power to impose tonnage and poundage duties, i. e.,\nduties on imports and exports, as had been the custom, but\ninstead granted the power for only one year. </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/#539\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">Id., at 539</a></span><pre class=\"inline\">.\nThe members of Commons “had no intention of refusing a\nfurther supply, but were resolved to avail themselves of their\nConstitutional right to make it dependent upon redress of\ngrievances.” </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">Ibid.</a></span><pre class=\"inline\"> Indignant about this temerity, the King\nhastily dissolved Parliament before the Lords passed the bill.\n</pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/#540\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">Id., at 540</a></span><pre class=\"inline\">; Smith 318. But as a consequence, the King once\nagain then found himself without suffcient funds. So he\ntook matters into his own hands by resorting to the mon-\narchy&#x27;s “old illegal methods of raising money.” Taswell-\nLangmead 543.\n   This reignited a power struggle between the two\nbranches. As a result, when Charles I again turned to Par-\nliament in 1628, the Commons refused to grant funds until\nhe agreed to the Petition of Right, which demanded that he\n\f456 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD.\n                   Alito, J., dissenting\n\ncease efforts to obtain more “ordinary income” by objection-\nable means, such as compulsory loans and the payment of\n“any tax, tallage,8 aid, or other like charge not set by com-\nmon consent, in parliament.” 3 Car. I., c. 1. (1628). The\nKing, of course, did not like this. So when the Commons\ncontinued to challenge royal prerogatives, Charles I pro-\nrogued Parliament. And during the long period that ensued\nin which Parliament did not meet (1629–1640), the King\nsought new sources of “ordinary income,” including the impo-\nsition of “Ship-money,” that is, fees imposed on both mari-\ntime and inland counties to pay for the construction of ships.\nTaswell-Langmead 566–569. These practices “further en-\nraged an already alienated Parliament, reinforcing a vicious\ncycle that led to the Civil War and, ultimately, to Charles&#x27;s\nbeheading.” Chafetz 47.\n   This constitutional crisis restored the English Govern-\nment&#x27;s fnancial separation of powers for a season. During\nthe Commonwealth, the Commons exercised “complete au-\nPage Proof Pending Publication\nthority . . . over the whole receipts and expenditure of the\nnational treasury.” Taswell-Langmead 626. But shortly\nafter the Restoration, the war for the supremacy of the purse\nreignited. Starting in 1665, “Parliament was largely unwill-\ning to grant [the King] additional money without specifying\nin some measure how it was to be used.” Chafetz 50.\n“This precedent was followed in some, but not all . . . cases\nunder Charles II.” Maitland 310. Charles II, “fed up with\nparliamentary interference, ruled without Parliament, and\ntherefore without any parliamentary taxation, for the rest of\nhis reign.” Chafetz 50.\n   After the Revolution of 1688, Parliament took strong\nmeasures to curb the Crown&#x27;s fnancial independence. The\n1689 Bill of Rights declared “[t]hat levying Money for or to\nthe Use of the Crowne by pretence of Prerogative, without\n  8\n   A tallage is “[a]n arbitrary tax levied by the monarch on towns and\nlands belonging to the crown.” Black&#x27;s Law Dictionary 1756 (11th ed.\n2009).\n\f                    Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)             457\n\n                        Alito, J., dissenting\n\nGrant of Parlyament for longer time or in other manner than\nthe same is or shall be granted is Illegall.” 1 Wm. 3 &amp; Mary\n2, c. 2 (1688). In other words, to ensure “that it was\nsupreme in directing the use of [all] public funds,” Parlia-\nment “asserted that any use of funds by the monarch that\nlacked Parliament&#x27;s authorization was unlawful.” Congres-\nsional Research Service, S. Stiff, Congress&#x27;s Power Over\nAppropriations: Constitutional and Statutory Provisions 8\n(2020).\n   These steps, however, did not cement Parliament&#x27;s power\nof the purse. Royal offcers continued to collect revenue and\nto evade the appropriations requirement by exaggerating\ncollection costs, giving very little in “net receipts” to Parlia-\nment, and keeping the rest for the use of the Crown. P. Ein-\nzig, The Control of the Purse 164, 188 (1959) (Einzig). So\nParliament took steps to crack down on this practice. Id.,\nat 188. In 1711, for example, Parliament passed a resolution\nPage Proof Pending Publication\ndeclaring that “ `applying any sum of un-appropriated money,\nor surplusages of funds to usages not voted, or addressed\nfor by parliament, hath been a misapplication of the public\nmoney.&#x27; ” 6 Cobbett&#x27;s Parliamentary History of England\n1025 (1810).\n   Parliament also appointed a commission to prevent the\nCrown from defying the appropriations requirement. In\nthat commission&#x27;s very frst report, it recommended that\n“[r]evenue should come from the Pocket of the Subject di-\nrectly into the Exchequer.” Report Relative to the Bal-\nances in the Hands of the Receivers General of the Land\nTax, Nov. 27, 1780 (First Report), reprinted in 1 Reports of\nthe Commissioners Appointed To Examine, Take, and State\nthe Public Accounts of the Kingdom 14 (W. Molleson ed.\n1783). Permitting revenue departments to retain or divert\nany public funds, the Commissioners concluded, would create\na “private Interest . . . in direct Opposition to that of the\nPublic.” Ibid. Finally, Parliament took an increasingly\n“frmer line . . . against virement, that is, the transfer of\n\f458 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD.\n                   Alito, J., dissenting\n\nfunds appropriated for one department for the use of another\ndepartment.” Einzig 144.\n                             2\n   The Court&#x27;s treatment of this history begins by conceding\nmost of what I have recounted. The Court notes that after\nthe Revolution of 1688, “Parliament&#x27;s usual practice was to\nappropriate government revenue `to particular purposes\nmore or less narrowly defned,&#x27; ” and “Parliament began lim-\niting the duration of its revenue grants.” Ante, at 428 (quot-\ning Maitland 433). “ `Every year,&#x27; ” the Court continues, the\nKing and his ministers “ `had to come, cap in hand, to the\nHouse of Commons, and more often than not the Commons\ndrove a bargain and exacted a quid pro quo in return for\nsupply.&#x27; ” Ante, at 429 (quoting G. Trevelyan, The English\nRevolution of 1688–1689, pp. 180–181 (1939)).\n   In an effort to fnd a trace of helpful precedent in pre-\nfounding British constitutional history, the Court turns to\nPage Proof Pending Publication\nlaws appropriating funds for the “civil list,” which it touts\nas a particularly “notable exception” to the centuries-long\nunderstanding of appropriations. Ante, at 429, 432, 439. In\ntruth, however, Parliament&#x27;s treatment of the civil list actu-\nally undermines the Court&#x27;s position. The civil list, al-\nthough renamed in 2012, remains to this day, and it consists\nof the money needed to cover the expenses of the royal fam-\nily.9 By the end of the 17th century, “the Civil List was a\nrelatively small share of the total public expenditure,” but\nthe independence it afforded the Crown “presented a consti-\ntutional problem in the confict between the principle of the\nindependence of the Crown and the principle of parlia-\nmentary control of fnance.” E. Reitan, The Civil List in\nEighteenth-Century British Politics: Parliamentary Suprem-\nacy Versus the Independence of the Crown, 9 Hist. J. 318,\n320, 322 (1966) (Reitan).\n\n  9\n   See Royal Finances, https://www.royal.uk/royal-finances (Apr. 22,\n2024).\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)             459\n\n                       Alito, J., dissenting\n\n   To prevent the Crown from using the civil list to erode\nParliament&#x27;s hard-fought supremacy over the purse, eminent\nstatesmen like Edmund Burke and Charles James Fox began\npushing for substantial reforms. </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">Id.,</a></span><pre class=\"inline\"> at 328–337. Begin-\nning in 1760, Parliament enacted a series of laws that altered\nthe appropriation of civil list funds. Id., at 324; see, e.g.,\n1 H. Cavendish, Debates of the House of Commons 267–307\n(1841). And by 1782, Parliament fnally secured its “right\n. . . to interfere at its discretion in the affairs of the Civil\nList.” Reitan 336–337. “The eighteenth-century tension\nbetween the conficting principles of parliamentary suprem-\nacy and an independent fnancial provision for the Crown had\nbeen resolved—as it had to be—in favour of parliamentary\nsupremacy.” Id., at 336.\n                                C\n                                1\n  “The conficts between Parliament and the Crown over the\nPage       Proof Pending Publication\npower of the purse . . . were replayed in the American colo-\nnies in struggles between the royal governors and provincial\nassemblies.” R. Rosen, Funding “Non-Traditional” Military\nOperations: The Alluring Myth of a Presidential Power of\nthe Purse, </pre><span class=\"citation no-link\">155 Mil. L. Rev. 1</span><pre class=\"inline\">, 44 (1998); see also P. Wolfson,\nIs a Presidential Item Veto Constitutional? 96 Yale L. J.\n838, 841–842 (1987). But learning from Parliament&#x27;s experi-\nences with the monarchy, some of the American Colonies as-\nsumed appropriations authority “greater even than that of\nthe British House of Commons,” exercising signifcant audit-\ning powers and legislative oversight. J. Greene, The Quest\nfor Power: The Lower Houses of Assembly in the Southern\nRoyal Colonies 106 (1963). Indeed, by 1787, all but one of\nthe 11 State Constitutions provided their respective legisla-\ntures with some control over appropriations; and no State\nallowed the executive to draw money from the state treasury\nwithout legislative approval. Chafetz 55, and nn. 119–120\n(citing provisions); see also The Federalist No. 48, at 310\n\f460 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD.\n                   Alito, J., dissenting\n\n(J. Madison) (noting that, under many state constitutions,\n“the legislative department alone has access to the pockets\nof the people”).\n   The Framers built on this legacy at the Constitutional\nConvention when they adopted the Appropriations Clause,\nwhich they “well understood” would “complet[e] the power\nvested in Congress over money.” 7 Annals of Cong. 1124\n(1798) (statement of Rep. Albert Gallatin). The Clause not\nonly “gives to the Legislature an exclusive authority of rais-\ning and granting money,” but it also obligates Congress to\nkeep that authority from “the hands of the Executive” at all\ntimes thereafter. </pre><span class=\"citation no-link\">Ibid.</span><pre class=\"inline\"> It makes the President “depen[d]\non the will of [Congress] for supplies of money” in the frst\ninstance and puts him continually “in a state of subordinate\ndependence” to the people&#x27;s elected representatives. 3 De-\nbates on the Constitution 17 (J. Elliot ed. 1836) (statement of\nWilson Nicholas). The Appropriations Clause enables Con-\nPage Proof Pending Publication\ngress, “without the concurrence of the other branches, to\ncheck, by refusing money, any mischief in the operations car-\nrying on in any department of the Government.” 5 Annals\nof Cong. 509 (1796) (statement of Rep. William Branch Giles)\n(emphasis added).\n   Early budgets illustrate how the appropriations power\nwas understood. Although the Constitution does not re-\nquire that appropriations be limited to a single year, that\nwas the dominant practice in the years immediately follow-\ning the adoption of the Constitution. See ante, at 432. And\nwhile the frst few appropriations laws were brief and lacked\ndetails about how the money was to be spent, the amounts\napproved closely tracked the estimates submitted by Secre-\ntary of the Treasury Alexander Hamilton. See Chafetz\n58–59. Indeed, the second appropriations act expressly in-\ncorporated the estimates of specifc expenses contained in\nHamilton&#x27;s report to Congress. Compare Appropriations\nAct, § 1, </pre><span class=\"citation no-link\">1 Stat. 104</span><pre class=\"inline\">, with 5 American State Papers: Finance\n\f                        Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)                      461\n\n                            Alito, J., dissenting\n\n33 (1832). As a result, Congress clearly contemplated that\nthe money would be devoted toward particular purposes.\n   In the mid-1790s, appropriations laws became even more\nspecifc. Chafetz 59. And when Thomas Jefferson became\nPresident, he urged Congress “to multiply barriers against”\nthe “dissipation” of public funds by “appropriating specifc\nsums to every specifc purpose susceptible of defnition,” and\n“by disallowing applications of money varying from the ap-\npropriation in object, or transcending it in amount.” First\nAnnual Message (Dec. 8, 1801), reprinted in 9 The Works of\nThomas Jefferson 336 (P. Ford ed. 1905); see also Letter from\nAlbert Gallatin to Thomas Jefferson (Nov. 1801), reprinted\nin 1 The Writings of Albert Gallatin 68 (H. Adams ed. 1879)\n(“Congress should adopt such measures as will effectually\nguard against misapplication of public moneys”).\n   To be sure, not all early funding laws followed the domi-\nnant model of specifed short-term appropriations. Agen-\ncies that provided services to a particular segment of the\nPage Proof Pending Publication\npublic were funded by fees that were paid by the recipients\nof those services. See, e. g., Act of Feb. 20, 1792, §§ 2–3, 1\nStat. 233–234 (funding the Post Offce through collection of\npostage rates); Act of Apr. 2, 1792, ch. 16, §§ 1, 14, </pre><span class=\"citation no-link\">1 Stat. 246</span><pre class=\"inline\">,\n249 (funding the National Mint in part through collection of\nfees); Act of July 31, 1789, § 29, 1 Stat. 44–45 (funding cus-\ntoms collection through tonnage fees). If these fees ex-\nceeded the costs of providing the services, however, these\nagencies were required to send the surplus to the Treasury,\nwhich oversaw the collection and use of such fees.10\n   10\n      At the founding, it was well understood that “the unexpended balance\nof any appropriation after a given period passes to the surplus fund.” 16\nAnnals of Cong. 393 (1807) (statement of Rep. David Thomas). See, e. g.,\nAct of Feb. 11, 1791, ch. 6, </pre><span class=\"citation no-link\">1 Stat. 190</span><pre class=\"inline\"> (recognizing default rule that surplus\nfunds return to the Treasury); see also Act of Feb. 20, 1792, §§ 3–4, </pre><span class=\"citation no-link\">1 Stat.\n234</span><pre class=\"inline\"> (requiring the Postmaster General to “pay, quarterly, into the treasury\nof the United States, the balance” of any receipts after using them to\n“defray the expense” of services provided); Act of July 31, 1789, § 38, 1\n\f462 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD.\n                   Alito, J., dissenting\n\n   As the Government notes, Brief for Petitioners 21–22, this\npractice had deep historical roots, see N. Parrillo, Against\nthe Proft Motive 65 (2013) (Parrillo),11 and was presumably\nbased on the idea that the cost of providing certain services\nshould be borne by the recipients of those services rather\nthan the general public. At the same time, the requirement\nthat fees in excess of what was needed to defray the cost of\nproviding services be turned over to the Treasury ensured\nthat Congress maintained control over the ways in which\nthis money was spent. Under these arrangements, there-\nfore, Congress exercised close control over both the amount\nof money that the agencies in question obtained and the way\nin which that money was used. The agencies received and\nwere allowed to use the amount of money necessary to pro-\nvide their narrowly prescribed services. All the rest was\nsent to the Treasury and could then be used only as author-\nized by a congressional appropriation.\n\nPage Proof Pending\n              2    Publication\n   In discussing this early American history, the Court be-\ngins by essentially conceding the principal lesson outlined\nabove. As the Court candidly puts it, “ `[w]hen called upon\nto grant supplies,&#x27; the lower houses in the colonial assemblies\n`insisted upon appropriating them in detail.&#x27; ” Ante, at 430.12\nThe best the Court can muster to support its assertion that\n“state legislative bodies often opted for open-ended, discre-\ntionary appropriations” are a few minor state laws that,\nwhen understood in relation to the Constitutions of the\n\nStat. 48 (providing that an unexpended portion of all customs and fnes\nshall be “paid into the treasury” thereof); Act of Sept. 2, 1789, ch. 12, § 2,\n</pre><span class=\"citation no-link\">1 Stat. 65</span><pre class=\"inline\"> (“[I]t shall be the duty of the Secretary of the Treasury to . . .\nsuperintend the collection of the revenue”).\n   11\n      Parliament and “nearly all the American colonial legislatures” used\nsuch fees “to cover many and sometimes all of the offces within their\nrespective bounds.” Parrillo 65.\n   12\n      Many sources document this general approach. See, e. g., P. Figley &amp;\nJ. Tidmarsh, The Appropriations Power and Sovereign Immunity, </pre><span class=\"citation no-link\">107\nMich. L. Rev. 1207</span><pre class=\"inline\">, 1244 (2009).\n\f                       Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)                    463\n\n                           Alito, J., dissenting\n\nStates in question, provide no support for the Court&#x27;s argu-\nment. Ibid.13\n                        *    *     *\n  In sum, centuries of historical practice show that the Ap-\npropriations Clause demands legislative control over the\nsource and disposition of the money used to fnance Govern-\nment operations and projects.14\n\n  13\n      Citing two Massachusetts laws directing that certain revenue be used\nfor broadly defned purposes, the Court infers that the executive enjoyed\nwide discretion to decide how this money would be spent, see ante, at 430,\nbut this inference is unwarranted. One of the two Massachusetts laws\ncited by the Court, Act of Nov. 17, 1786, 1786 Mass. Acts and Laws ch. 47,\np. 117, clearly illustrates this point. That law stated expressly that the\nrevenue in question was to be paid “into the Treasury of this Common-\nwealth, for the exigencies of Government.” </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">Ibid.</a></span><pre class=\"inline\"> Under the State Con-\nstitution, this money could be not be taken from the treasury without the\napproval of the legislature. See Mass. Const. of 1780, ch. 2, § 1, Art. XI.\nAnd to fortify legislative control, the state treasurer was elected annually\nPage Proof Pending Publication\nby the legislature. Id., ch. 2, § 4.\n   As another supposed example of a state law giving the executive wide\ndiscretion to decide how funds could be spent, the Court cites a Maryland\nlaw specifying that certain revenue was to be used for the general purpose\nof defending the Chesapeake Bay and protecting trade. 1783 Md. Acts\nch. 26, § 5, reprinted in 1 W. Kilty, The Laws of Maryland (1799). The\nCourt overlooks the fact that under the State&#x27;s Constitution, the two state\ntreasurers were appointed by and served at the pleasure of the legislature,\nMaryland Constitution of 1776, Art. XIII, and the legislature was specif-\ncally authorized to “examine and pass all accounts of the State, relating\neither to the collection or expenditure of the revenue, or appoint auditors,\nto state and adjust the same,” Art. X.\n   Finally, the Court points to a Virginia law, ante, at 430, but again the\nCourt overlooks the structure of the Virginia government. Under the\nVirginia Constitution of 1776, the treasurer was elected annually by the\nlegislature, and this obviously gave the legislature extensive power over\nexpenditures. Virginia Constitution of 1776, ¶17; see Chafetz 55 (refer-\nring to the Virginia Legislature&#x27;s authority over the state treasurer as an\n“explicit mechanism of legislative control over appropriations”).\n   14\n      Not content to rest on the Court&#x27;s argument, which relies on the\nCourt&#x27;s understanding of the original meaning of the Appropriations\nClause, four Justices advance an entirely different rationale, namely, that\ncongressional practice in the ensuing centuries supports the constitution-\n\f464 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD.\n                   Alito, J., dissenting\n\n                                    III\n                                     A\n   As the previous discussion shows, today&#x27;s case turns on\na simple question: Is the CFPB fnancially accountable to\nCongress in the way the Appropriations Clause demands?\nHistory tells us it is not. As we said in Seila Law, “ `[p]er-\nhaps the most telling indication of [a] severe constitutional\nproblem&#x27; with an executive entity `is [a] lack of historical\nprecedent&#x27; to support it.” 591 U. S., at 220 (quoting Free\nEnterprise Fund v. Public Company Accounting Oversight\nBd., </pre><span class=\"citation multiple-matches\"><a href=\"/c/U.%20S./561/477/\">561 U. S. 477</a></span><pre class=\"inline\">, 505 (2010)). And the Government agrees\nwith this principle. In its briefng and at argument, the\nGovernment admitted that an utterly unprecedented funding\nscheme would raise a serious constitutional problem. Reply\nBrief 18; Tr. of Oral Arg. 11, 26. The Government therefore\nattempts to show that there is ample precedent for the\nCFPB scheme, but that effort fails.\nPage Proof Pending Publication\n   The CFPB&#x27;s funding scheme contains the following fea-\ntures: (1) it applies in perpetuity; (2) the CFPB has discre-\ntion to select the amount of funding that it receives, up to a\nstatutory cap; (3) the funds taken by the CFPB come from\nother entities; (4) those entities are self-funded corporations\nthat obtain their funding from fees on private parties, “not\ndepartments of the Government,” Emergency Fleet Corp.,\n</pre><span class=\"citation\" data-id=\"101189\"><a href=\"/opinion/101189/emergency-fleet-corp-v-western-union-telegraph-co/#426\" aria-description=\"Citation for case: Emergency Fleet Corp. v. Western Union Telegraph Co.\">275 U. S., at 426</a></span><pre class=\"inline\">; (5) the CFPB is not required to return un-\n\nality of the CFPB&#x27;s scheme. Ante, at 441 (Kagan, J., concurring). This\nargument is doubly fawed. First, the concurrence cannot point to any\nother law that created a funding scheme like the CFPB&#x27;s. Second, as\nexplained by Justice Scalia, the separation of powers mandated by the\nConstitution cannot be altered by a course of practice at odds with our\nnational charter. See NLRB v. Noel Canning, </pre><span class=\"citation no-link\">573 U. S. 513</span><pre class=\"inline\">, 571–572\n(2014) (opinion concurring in judgment). “[P]olicing the `enduring struc-\nture&#x27; of constitutional government when the political branches fail to do\nso is `one of the most vital functions of this Court.&#x27; ” </pre><span class=\"citation no-link\">Id.,</span><pre class=\"inline\"> at 572 (quoting\nPublic Citizen v. Department of Justice, </pre><span class=\"citation\" data-id=\"9431772\"><a href=\"/opinion/112305/public-citizen-v-united-states-department-of-justice/#468\" aria-description=\"Citation for case: Public Citizen v. United States Department of Justice\">491 U. S. 440, 468</a></span><pre class=\"inline\"> (1989) (Ken-\nnedy, J., concurring in judgment)).\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)             465\n\n                       Alito, J., dissenting\n\nspent funds or transfer them to the Treasury; and (6) those\nfunds may be placed in a separate fund that earns interest\nand may be used to pay the CFPB&#x27;s expenses in the future.\nAt argument, the Government was unable to cite any other\nagency with a funding scheme like this, see Tr. of Oral Arg.\n31–33, 39–41, and thus no other agency—old or new—has\nenjoyed so many layers of insulation from accountability to\nCongress.\n   The Government points to the Post Offce and the Customs\nService as founding-era precedents for the CFPB, but the\nanalogy is fawed. As noted, funding Government agencies\nwith fees charged to the benefciaries of their services has\nlong been viewed as consistent with the appropriations re-\nquirement. And both the Post Offce and the Customs Serv-\nice fell comfortably into that category.\n   A quick look at the laws that set up the Post Offce and\nthe Customs Service shows that they were nothing like the\nPage Proof Pending Publication\nCFPB. In the Act establishing the Post Offce, Congress\ngave that agency a narrow and specifc mission: to “provide\nfor carrying the mail of the United States.” See, e. g., Act\nof Feb. 20, 1792, § 3, </pre><span class=\"citation no-link\">1 Stat. 234</span><pre class=\"inline\">. The Postmaster&#x27;s discre-\ntionary authority was modest. (He could, for example, de-\ncide whether mail should be carried on particular routes “by\nstage carriages or horses.” Ibid.) The Act specifed in min-\nute detail the fees that could be collected from those who\nused the Post Offce&#x27;s services. § 9, id., at 235. And it re-\nquired the Postmaster “to render to the secretary of the\ntreasury, a quarterly account of all the receipts and expendi-\ntures” and to “pay quarterly, into the treasury . . . , the bal-\nance in his hands.” § 4, id., at 234. Under this arrange-\nment, Congress controlled the amount that the Post Offce\ntook in (i. e., the sum total of the fees specifed by law) and\nhow those fees were to be spent (i. e., to provide for carrying\nthe mail).\n   Much the same is true with respect to the Customs Serv-\nice, which the Government claims “best” resembles the\n\f466 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD.\n                   Alito, J., dissenting\n\nCFPB. Tr. of Oral Arg. 31. Like the Post Offce, the Cus-\ntoms Service had a carefully delineated mission—basically,\nto control imports and exports, and to collect duties and\nother payments from those engaged in those activities. To\nmaintain accountability, the early tariff Acts spelled out in\nexcruciating detail the various fees, fnes, and forfeitures\nthat offcers were to collect, as well as the salaries and com-\nmissions that were to be paid out of those receipts. Act of\nJuly 31, 1789, ch. 5, 1 Stat. 29–49; L. Schmeckebier, The Cus-\ntoms Service: Its History, Activities and Organization 3–6\n(1924). Surplus funds had to be sent to the Treasury, Act of\nJuly 31, 1789, §§ 9, 38, </pre><span class=\"citation no-link\">1 Stat. 38</span><pre class=\"inline\">, 48, and for many years,\nthese funds were the lifeblood of the Federal Government.\nFrom 1789 to 1862, “[n]early all of federal revenue was de-\nrived from customs duties.” A. Reamer, Before the U. S.\nTariff Commission: Congressional Efforts To Obtain Statis-\ntics and Analysis for Tariff-setting, 1789–1916, in A Cen-\ntennial History of the United States International Trade\nPage Proof Pending Publication\nCommission 35 (2017).15\n   The CFPB, by contrast, is an entirely different creature.\nIts powers are broad and vast. It enjoys substantial discre-\ntionary authority. It does not collect fees from persons and\nentities to which it provides services or persons and entities\nthat are subject to its authority. And it is permitted to keep\nand invest surplus funds. In short, the Government&#x27;s “best”\nargument fails.\n   The Government&#x27;s next-best analogs fare no better. Mov-\ning to modern agencies, the Government claims that the\nCFPB&#x27;s funding scheme is not materially different from the\nfunding schemes of a list of other currently existing agencies.\nSee Brief for Petitioners 22–23, 29–36 (comparing the CFPB\nto the Offce of the Comptroller of the Currency (OCC), the\nFederal Deposit Insurance Corporation (FDIC), the National\n  15\n    “In 1792, for example, customs duties . . . accounted for $3.4 million of\nthe $3.7 million of total government receipts.” Founding Choices: Ameri-\ncan Economic Policy in the 1790s, p. 101 (D. Irwin &amp; R. Sylla eds. 2010).\n\f                       Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)                     467\n\n                           Alito, J., dissenting\n\nCredit Union Administration (NCUA), the Farm Credit Ad-\nministration (FCA), the Federal Housing Finance Agency\n(FHFA), and others).\n   But unlike the CFPB, the agencies cited by the Govern-\nment are funded in whole or in part by fees charged those\nwho make use of their services or are subject to their regula-\ntion. This is true for the OCC, see </pre><span class=\"citation no-link\">12 U. S. C. § 16</span><pre class=\"inline\">; the\nFDIC, see § 1815; the NCUA, see § 1755; the FCA, § 2250;\nand the FHFA, see § 4516.16\n   For these reasons, it is undeniable that the combination of\nfeatures in the CFPB funding scheme is unprecedented.\nAnd it is likewise clear that this assemblage was no accident.\nRather, it was carefully designed to give the Bureau maxi-\nmum unaccountability. Our decision in Seila Law ad-\ndressed part of the problem posed by this arrangement. It\nmade the CFPB accountable to the President, but that deci-\nsion did nothing to protect Congress&#x27;s power of the purse.\nIndeed, standing alone, Seila Law worsens the appropria-\nPage Proof Pending Publication\ntions problem. The appropriations requirement developed\nto ensure that the Executive (in England, the monarch)\nwould be accountable to the people&#x27;s elected representatives.\n  16\n     The Government also suggested that the Federal Reserve Board is a\nclose historical analog for the CFPB. Brief for Petitioners 23; Tr. of Oral\nArg. 41. But that setup should not be seen as a model for other Govern-\nment bodies. The Board, which is funded by the earnings of the Federal\nReserve Banks, </pre><span class=\"citation no-link\">12 U. S. C. §§ 243</span><pre class=\"inline\">, 244, is a unique institution with a unique\nhistorical background. It includes the creation and demise of the First\nand Second Banks of the United States, as well as the string of fnancial\npanics (in 1873, 1893, and 1907) that were widely attributed to the coun-\ntry&#x27;s lack of a national bank. See generally O. Sprague, History of Crises\nUnder the National Banking System, S. Doc. No. 538, 61st Cong., 2d Sess.\n(1910). The structure adopted in the Federal Reserve Act of 1913 repre-\nsented an intensely-bargained compromise between two insistent and in-\nfuential camps: those who wanted a largely private system, and those who\nfavored a Government-controlled national bank. See, e. g., R. Lowenstein,\nAmerica&#x27;s Bank 5–8, 113–116, 265 (2015). For Appropriations Clause pur-\nposes, the funding of the Federal Reserve Board should be regarded as a\nspecial arrangement sanctioned by history.\n\f468 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD.\n                   Alito, J., dissenting\n\nSeila Law, however, increased the power of the Executive\nover appropriations. By brandishing or wielding the threat\nof removal, a President may push the CFPB director to req-\nuisition the amount of money that the President thinks is\nappropriate and to spend that money as the President\nwishes. I joined the decision in Seila Law and continue to\nbelieve that it was correctly decided, but it solved only half\nthe accountability problem that inheres in the CFPB&#x27;s\nstructure.\n                              B\n   Left with no analog in history, the Government employs a\ndivide-and-conquer strategy to defend the CFPB&#x27;s funding\nscheme. It argues that even if no prior agency had a fund-\ning scheme with all the features of the CFPB&#x27;s, the funding\nschemes of other presumptively constitutional agencies con-\ntain one or more of the features found in the CFPB&#x27;s scheme.\nIt then reasons that the combination of these features in the\nPage Proof Pending Publication\nCFPB&#x27;s scheme must be constitutional as well.\n   This argument founders for two reasons. First, the\nCFPB&#x27;s scheme includes an important feature never before\nseen. As explained, the CFPB&#x27;s money does not come from\nCongress, from private recipients of its services, or from pri-\nvate entities that it regulates. It does not even originate\nwith another Government agency. Instead, the CFPB gets\nits money via a three-step process: The Federal Reserve\nBanks earn money from the purchase and sale of securities,\nas well as from the fees they charge for providing services\nto depository institutions. The Federal Reserve Banks\nthen deliver these earnings to the Federal Reserve System.\nFinally, the CFPB requests an amount from the Federal Re-\nserve Board. That feature of the CFPB scheme is entirely\nnew.\n   Second, the Government&#x27;s argument fails “to engage with\nthe Dodd-Frank Act as a whole.” Seila Law, 591 U. S., at\n230. By addressing the individual elements of the CFPB&#x27;s\nsetup one-by-one, the Government seeks to divert attention\n\f                   Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)            469\n\n                       Alito, J., dissenting\n\nfrom the combined layers that insulate the CFPB from ac-\ncountability to Congress. Elements that are safe or tolera-\nble in isolation may be unsafe when combined. In the case\nof the CFPB, the combination is deadly. The whole point of\nthe appropriations requirement is to protect “the right of\nthe people,” through their elected representatives in Con-\ngress, to “be actually consulted” about the expenditure of\npublic money. St. George Tucker, View of the Constitution\nof the United States 297 (1803) (C. Wilson ed. 1999). The\nCFPB&#x27;s design strips the people of this power.\n   The Federal Reserve&#x27;s earnings represent “specific\ncharges for specifc services to specifc individuals or compa-\nnies.” FPC v. New England Power Co., </pre><span class=\"citation\" data-id=\"9425620\"><a href=\"/opinion/108978/federal-power-commission-v-new-england-power-co/#349\" aria-description=\"Citation for case: Federal Power Commission v. New England Power Co.\">415 U. S. 345, 349</a></span><pre class=\"inline\">\n(1974). It would be “a sharp break with our traditions” to\nallow the CFPB to use these earnings to fund a broader\narray of governmental activities that have little-to-no rela-\ntionship with those specifc charges, services, and regulated\nPage Proof Pending Publication\nentities. National Cable Television Assn., Inc. v. United\nStates, </pre><span class=\"citation\" data-id=\"108977\"><a href=\"/opinion/108977/national-cable-television-assn-inc-v-united-states/#341\" aria-description=\"Citation for case: National Cable Television Assn., Inc. v. United States\">415 U. S. 336, 341</a></span><pre class=\"inline\"> (1974). By allowing the CFPB to\nuse the Federal Reserve&#x27;s earnings to enforce and implement\nbroader consumer protection laws, Congress impermissibly\nremoved the CFPB “from its customary orbit” as an agency,\nauthorizing the Bureau to appropriate funds obtained from\nprivate sources “in the manner of an Appropriations Com-\nmittee.” </pre><span class=\"citation\" data-id=\"108977\"><a href=\"/opinion/108977/national-cable-television-assn-inc-v-united-states/\" aria-description=\"Citation for case: National Cable Television Assn., Inc. v. United States\">Ibid.</a></span><pre class=\"inline\"> In other words, Congress abdicated its ap-\npropriations authority, an exclusively legislative prerogative.\nKnote v. United States, </pre><span class=\"citation\" data-id=\"89572\"><a href=\"/opinion/89572/knote-v-united-states/#156\" aria-description=\"Citation for case: Knote v. United States\">95 U. S. 149, 156</a></span><pre class=\"inline\"> (1877). But Con-\ngress lacks the authority to “transfer to another branch pow-\ners which are strictly and exclusively legislative.” Gundy\nv. United States, </pre><span class=\"citation no-link\">588 U. S. 128</span><pre class=\"inline\">, 135 (2019) (plurality opinion)\n(internal quotation marks omitted).\n   In sum, the CFPB&#x27;s unprecedented combination of funding\nfeatures affords it the very kind of fnancial independence\nthat the Appropriations Clause was designed to prevent. It\nis not an exaggeration to say that the CFPB enjoys a degree\nof fnancial autonomy that a Stuart king would envy.\n\f470 CONSUMER FINANCIAL PROTECTION BUREAU v. COMMU-\n     NITY FINANCIAL SERVICES ASSN. OF AMERICA, LTD.\n                   Alito, J., dissenting\n\n                                   C\n   This autonomy has real-world consequences. The CFPB\nis a powerful agency with the authority to impose “substan-\ntive rules [on] a wide swath of industries” and “lev[y] knee-\nbuckling penalties against private citizens.” Seila Law, 591\nU. S., at 222, n. 8. In the last several months alone, the Bu-\nreau has announced plans to effectuate not one, but three\nmajor changes in consumer protection law. The CFPB has\nissued guidance cautioning fnancial institutions from “deny-\ning credit to individuals based on their [illegal] immigration\nstatus, regardless of their personal circumstances and dem-\nonstrated ability to repay.” 17 It has also begun “a rule-\nmaking process to remove medical bills from Americans&#x27;\ncredit reports” 18 and to cap overdraft fees “at an established\nbenchmark—as low as $3.” 19 These may or may not be wise\npolicies, but Congress did not specifcally authorize any of\nthem, and if the CFPB&#x27;s fnancing scheme is sustained, Con-\nPage Proof Pending Publication\ngress cannot control or monitor the CFPB&#x27;s use of funds to\nimplement such changes. That is precisely what the Appro-\npriations Clause was meant to prevent.\n\n                            *      *     *\n  The Court holds that the Appropriations Clause is satisfed\nby any law that authorizes the Executive to take any amount\nof money from any source for any period of time for any\nlawful purpose. That holding has the virtue of clarity, but\n\n  17\n      Press Release, Consumer Financial Protection Bureau, CFPB and Jus-\ntice Department Issue Joint Statement Cautioning That Financial Institu-\ntions May Not Use Immigration Status To Illegally Discriminate Against\nCredit Applicants (Oct. 12, 2023).\n   18\n      Press Release, Consumer Financial Protection Bureau, CFPB Kicks\nOff Rulemaking To Remove Medical Bills From Credit Reports (Sept.\n21, 2023).\n   19\n      Press Release, Consumer Financial Protection Bureau, CFPB Pro-\nposes Rule To Close Bank Overdraft Loophole That Costs Americans Bil-\nlions Each Year in Junk Fees (Jan. 17, 2024).\n\f                       Cite as: </pre><span class=\"citation\" data-id=\"11066682\"><a href=\"/opinion/10600094/consumer-financial-protection-bureau-v-community-financial-services-assn/\" aria-description=\"Citation for case: Consumer Financial Protection Bureau v. Community...\">601 U. S. 416</a></span><pre class=\"inline\"> (2024)                     471\n\n                           Alito, J., dissenting\n\nsuch clarity comes at too high a price. There are times\nwhen it is our duty to say simply that a law that blatantly\nattempts to circumvent the Constitution goes too far. This\nis such a case. Today&#x27;s decision is not faithful to the original\nunderstanding of the Appropriations Clause and the centu-\nries of history that gave birth to the appropriations require-\nment,20 and I therefore respectfully dissent.\n\n\n\n\nPage Proof Pending Publication\n\n\n\n\n   20\n      At the end of its opinion, the Court suggests that broad separation of\npowers principles may provide more protection for Congress&#x27;s power of\nthe purse than does the Appropriations Clause. Ante, at 437–438. But\nwe do not generally resort to broad principles when a provision of the\nConstitution specifcally addresses the question at hand. See County of\nSacramento v. Lewis, </pre><span class=\"citation\" data-id=\"9433650\"><a href=\"/opinion/118214/county-of-sacramento-v-lewis/#843\" aria-description=\"Citation for case: County of Sacramento v. Lewis\">523 U. S. 833, 843</a></span><pre class=\"inline\"> (1998). At any rate, since the\ndecision below relied on both the Appropriations Clause and broad separa-\ntion of powers principles, </pre><span class=\"citation no-link\">51 F. 4th 616</span><pre class=\"inline\">, 635 (CA5 2022), it is not clear why\nthe Court does not proceed to apply those principles.\n\f                           Reporter’s Note\n\n  The attached opinion has been revised to refect the usual publication\nand citation style of the United States Reports. The revised pagination\nmakes available the offcial United States Reports citation in advance of\npublication. The syllabus has been prepared by the Reporter of Decisions\nPage Proof Pending Publication\nfor the convenience of the reader and constitutes no part of the opinion of\nthe Court. A list of counsel who argued or fled briefs in this case, and\nwho were members of the bar of this Court at the time this case was\nargued, has been inserted following the syllabus. Other revisions may\ninclude adjustments to formatting, captions, citation form, and any errant\npunctuation. The following additional edits were made:\n\nNone\n\f</pre>"
}
